Imports System.Windows.Forms.VisualStyles.VisualStyleElement

Public Class Form1

    '====================================================================================================================================================================

    ' 初期ロード

    '====================================================================================================================================================================

    'データ
    Public Pokemon_Basics() As String = {1, "フシギダネ", 45, 49, 49, 65, 65, 45, "くさ/どく", "しんりょく", 6.9, 2, "フシギソウ", 60, 62, 63, 80, 80, 60, "くさ/どく", "しんりょく", 13.0, 3, "フシギバナ", 80, 82, 83, 100, 100, 80, "くさ/どく", "しんりょく", 100.0, 4, "ヒトカゲ", 39, 52, 43, 60, 50, 65, "ほのお", "もうか", 8.5, 5, "リザード", 58, 64, 58, 80, 65, 80, "ほのお", "もうか", 19.0, 6, "リザードン", 78, 84, 78, 109, 85, 100, "ほのお/ひこう", "もうか", 90.5, 7, "ゼニガメ", 44, 48, 65, 50, 64, 43, "みず", "げきりゅう", 9.0, 8, "カメール", 59, 63, 80, 65, 80, 58, "みず", "げきりゅう", 22.5, 9, "カメックス", 79, 83, 100, 85, 105, 78, "みず", "げきりゅう", 85.5, 10, "キャタピー", 45, 30, 35, 20, 20, 45, "むし", "りんぷん", 2.9, 11, "トランセル", 50, 20, 55, 25, 25, 30, "むし", "だっぴ", 9.9, 12, "バタフリー", 60, 45, 50, 80, 80, 70, "むし/ひこう", "ふくがん", 32.0, 13, "ビードル", 40, 35, 30, 20, 20, 50, "むし/どく", "りんぷん", 3.2, 14, "コクーン", 45, 25, 50, 25, 25, 35, "むし/どく", "だっぴ", 10.0, 15, "スピアー", 65, 80, 40, 45, 80, 75, "むし/どく", "むしのしらせ", 29.5, 16, "ポッポ", 40, 45, 40, 35, 35, 56, "ノーマル/ひこう", "するどいめ/ちどりあし", 1.8, 17, "ピジョン", 63, 60, 55, 50, 50, 71, "ノーマル/ひこう", "するどいめ/ちどりあし", 30.0, 18, "ピジョット", 83, 80, 75, 70, 70, 91, "ノーマル/ひこう", "するどいめ/ちどりあし", 39.5, 19, "コラッタ", 30, 56, 35, 25, 35, 72, "ノーマル", "にげあし/こんじょう", 3.5, 20, "ラッタ", 55, 81, 60, 50, 70, 97, "ノーマル", "にげあし/こんじょう", 18.5, 21, "オニスズメ", 40, 60, 30, 31, 31, 70, "ノーマル/ひこう", "するどいめ", 2.0, 22, "オニドリル", 65, 90, 65, 61, 61, 100, "ノーマル/ひこう", "するどいめ", 38.0, 23, "アーボ", 35, 60, 44, 40, 54, 55, "どく", "いかく/だっぴ", 6.9, 24, "アーボック", 60, 85, 69, 65, 79, 80, "どく", "いかく/だっぴ", 65.0, 25, "ピカチュウ", 35, 55, 30, 50, 40, 90, "でんき", "せいでんき", 6.0, 26, "ライチュウ", 60, 90, 55, 90, 80, 100, "でんき", "せいでんき", 30.0, 27, "サンド", 50, 75, 85, 20, 30, 40, "じめん", "すながくれ", 12.0, 28, "サンドパン", 75, 100, 110, 45, 55, 65, "じめん", "すながくれ", 29.5, 29, "ニドラン♀", 55, 47, 52, 40, 40, 41, "どく", "どくのトゲ/とうそうしん", 7.0, 30, "ニドリーナ", 70, 62, 67, 55, 55, 56, "どく", "どくのトゲ/とうそうしん", 20.0, 31, "ニドクイン", 90, 82, 87, 75, 85, 76, "どく/じめん", "どくのトゲ/とうそうしん", 60.0, 32, "ニドラン♂", 46, 57, 40, 40, 40, 50, "どく", "どくのトゲ/とうそうしん", 9.0, 33, "ニドリーノ", 61, 72, 57, 55, 55, 65, "どく", "どくのトゲ/とうそうしん", 19.5, 34, "ニドキング", 81, 92, 77, 85, 75, 85, "どく/じめん", "どくのトゲ/とうそうしん", 62.0, 35, "ピッピ", 70, 45, 48, 60, 65, 35, "ノーマル", "メロメロボディ/マジックガード", 7.5, 36, "ピクシー", 95, 70, 73, 85, 90, 60, "ノーマル", "メロメロボディ/マジックガード", 40.0, 37, "ロコン", 38, 41, 40, 50, 65, 65, "ほのお", "もらいび", 9.9, 38, "キュウコン", 73, 76, 75, 81, 100, 100, "ほのお", "もらいび", 19.9, 39, "プリン", 115, 45, 20, 45, 25, 20, "ノーマル", "メロメロボディ", 5.5, 40, "プクリン", 140, 70, 45, 75, 50, 45, "ノーマル", "メロメロボディ", 12.0, 41, "ズバット", 40, 45, 35, 30, 40, 55, "どく/ひこう", "せいしんりょく", 7.5, 42, "ゴルバット", 75, 80, 70, 65, 75, 90, "どく/ひこう", "せいしんりょく", 55.0, 43, "ナゾノクサ", 45, 50, 55, 75, 65, 30, "くさ/どく", "ようりょくそ", 5.4, 44, "クサイハナ", 60, 65, 70, 85, 75, 40, "くさ/どく", "ようりょくそ", 8.6, 45, "ラフレシア", 75, 80, 85, 100, 90, 50, "くさ/どく", "ようりょくそ", 18.6, 46, "パラス", 35, 70, 55, 45, 55, 25, "むし/くさ", "ほうし/かんそうはだ", 5.4, 47, "パラセクト", 60, 95, 80, 60, 80, 30, "むし/くさ", "ほうし/かんそうはだ", 29.5, 48, "コンパン", 60, 55, 50, 40, 55, 45, "むし/どく", "ふくがん/いろめがね", 30.0, 49, "モルフォン", 70, 65, 60, 90, 75, 90, "むし/どく", "りんぷん/いろめがね", 12.5, 50, "ディグダ", 10, 55, 25, 35, 45, 95, "じめん", "すながくれ/ありじごく", 0.8, 51, "ダグトリオ", 35, 80, 50, 50, 70, 120, "じめん", "すながくれ/ありじごく", 33.3, 52, "ニャース", 40, 45, 35, 40, 40, 90, "ノーマル", "ものひろい/テクニシャン", 4.2, 53, "ペルシアン", 65, 70, 60, 65, 65, 115, "ノーマル", "じゅうなん/テクニシャン", 32.0, 54, "コダック", 50, 52, 48, 65, 50, 55, "みず", "しめりけ/ノーてんき", 19.6, 55, "ゴルダック", 80, 82, 78, 95, 80, 85, "みず", "しめりけ/ノーてんき", 76.6, 56, "マンキー", 40, 80, 35, 35, 45, 70, "かくとう", "やるき/いかりのつぼ", 28.0, 57, "オコリザル", 65, 105, 60, 60, 70, 95, "かくとう", "やるき/いかりのつぼ", 32.0, 58, "ガーディ", 55, 70, 45, 70, 50, 60, "ほのお", "いかく/もらいび", 19.0, 59, "ウインディ", 90, 110, 80, 100, 80, 95, "ほのお", "いかく/もらいび", 155.0, 60, "ニョロモ", 40, 50, 40, 40, 40, 90, "みず", "ちょすい/しめりけ", 12.4, 61, "ニョロゾ", 65, 65, 65, 50, 50, 90, "みず", "ちょすい/しめりけ", 20.0, 62, "ニョロボン", 90, 85, 95, 70, 90, 70, "みず/かくとう", "ちょすい/しめりけ", 54.0, 63, "ケーシィ", 25, 20, 15, 105, 55, 90, "エスパー", "シンクロ/せいしんりょく", 19.5, 64, "ユンゲラー", 40, 35, 30, 120, 70, 105, "エスパー", "シンクロ/せいしんりょく", 56.5, 65, "フーディン", 55, 50, 45, 135, 85, 120, "エスパー", "シンクロ/せいしんりょく", 48.0, 66, "ワンリキー", 70, 80, 50, 35, 35, 35, "かくとう", "こんじょう/ノーガード", 19.5, 67, "ゴーリキー", 80, 100, 70, 50, 60, 45, "かくとう", "こんじょう/ノーガード", 70.5, 68, "カイリキー", 90, 130, 80, 65, 85, 55, "かくとう", "こんじょう/ノーガード", 130.0, 69, "マダツボミ", 50, 75, 35, 70, 30, 40, "くさ/どく", "ようりょくそ", 4.0, 70, "ウツドン", 65, 90, 50, 85, 45, 55, "くさ/どく", "ようりょくそ", 6.4, 71, "ウツボット", 80, 105, 65, 100, 60, 70, "くさ/どく", "ようりょくそ", 15.5, 72, "メノクラゲ", 40, 40, 35, 50, 100, 70, "みず/どく", "クリアボディ/ヘドロえき", 45.5, 73, "ドククラゲ", 80, 70, 65, 80, 120, 100, "みず/どく", "クリアボディ/ヘドロえき", 55.0, 74, "イシツブテ", 40, 80, 100, 30, 30, 20, "いわ/じめん", "いしあたま/がんじょう", 20.0, 75, "ゴローン", 55, 95, 115, 45, 45, 35, "いわ/じめん", "いしあたま/がんじょう", 105.0, 76, "ゴローニャ", 80, 110, 130, 55, 65, 45, "いわ/じめん", "いしあたま/がんじょう", 300.0, 77, "ポニータ", 50, 85, 55, 65, 65, 90, "ほのお", "にげあし/もらいび", 30.0, 78, "ギャロップ", 65, 100, 70, 80, 80, 105, "ほのお", "にげあし/もらいび", 95.0, 79, "ヤドン", 90, 65, 65, 40, 40, 15, "みず/エスパー", "どんかん/マイペース", 36.0, 80, "ヤドラン", 95, 75, 110, 100, 80, 30, "みず/エスパー", "どんかん/マイペース", 78.5, 81, "コイル", 25, 35, 70, 95, 55, 45, "でんき/はがね", "じりょく/がんじょう", 6.0, 82, "レアコイル", 50, 60, 95, 120, 70, 70, "でんき/はがね", "じりょく/がんじょう", 60.0, 83, "カモネギ", 52, 65, 55, 58, 62, 60, "ノーマル/ひこう", "するどいめ/せいしんりょく", 15.0, 84, "ドードー", 35, 85, 45, 35, 35, 75, "ノーマル/ひこう", "にげあし/はやおき", 39.2, 85, "ドードリオ", 60, 110, 70, 60, 60, 100, "ノーマル/ひこう", "にげあし/はやおき", 85.2, 86, "パウワウ", 65, 45, 55, 45, 70, 45, "みず", "あついしぼう/うるおいボディ", 90.0, 87, "ジュゴン", 90, 70, 80, 70, 95, 70, "みず/こおり", "あついしぼう/うるおいボディ", 120.0, 88, "ベトベター", 80, 80, 50, 40, 50, 25, "どく", "あくしゅう/ねんちゃく", 30.0, 89, "ベトベトン", 105, 105, 75, 65, 100, 50, "どく", "あくしゅう/ねんちゃく", 30.0, 90, "シェルダー", 30, 65, 100, 45, 25, 40, "みず", "シェルアーマー/スキルリンク", 4.0, 91, "パルシェン", 50, 95, 180, 85, 45, 70, "みず/こおり", "シェルアーマー/スキルリンク", 132.5, 92, "ゴース", 30, 35, 30, 100, 35, 80, "ゴースト/どく", "ふゆう", 0.1, 93, "ゴースト", 45, 50, 45, 115, 55, 95, "ゴースト/どく", "ふゆう", 0.1, 94, "ゲンガー", 60, 65, 60, 130, 75, 110, "ゴースト/どく", "ふゆう", 40.5, 95, "イワーク", 35, 45, 160, 30, 45, 70, "いわ/じめん", "いしあたま/がんじょう", 210.0, 96, "スリープ", 60, 48, 45, 43, 90, 42, "エスパー", "ふみん/よちむ", 32.4, 97, "スリーパー", 85, 73, 70, 73, 115, 67, "エスパー", "ふみん/よちむ", 75.6, 98, "クラブ", 30, 105, 90, 25, 25, 50, "みず", "かいりきバサミ/シェルアーマー", 6.5, 99, "キングラー", 55, 130, 115, 50, 50, 75, "みず", "かいりきバサミ/シェルアーマー", 60.0, 100, "ビリリダマ", 40, 30, 50, 55, 55, 100, "でんき", "ぼうおん/せいでんき", 10.4, 101, "マルマイン", 60, 50, 70, 80, 80, 140, "でんき", "ぼうおん/せいでんき", 66.6, 102, "タマタマ", 60, 40, 80, 60, 45, 40, "くさ/エスパー", "ようりょくそ", 2.5, 103, "ナッシー", 95, 95, 85, 125, 65, 55, "くさ/エスパー", "ようりょくそ", 120.0, 104, "カラカラ", 50, 50, 95, 40, 50, 35, "じめん", "いしあたま/ひらいしん", 6.5, 105, "ガラガラ", 60, 80, 110, 50, 80, 45, "じめん", "いしあたま/ひらいしん", 45.0, 106, "サワムラー", 50, 120, 53, 35, 110, 87, "かくとう", "じゅうなん/すてみ", 49.8, 107, "エビワラー", 50, 105, 79, 35, 110, 76, "かくとう", "するどいめ/てつのこぶし", 50.2, 108, "ベロリンガ", 90, 55, 75, 60, 75, 30, "ノーマル", "マイペース/どんかん", 65.5, 109, "ドガース", 40, 65, 95, 60, 45, 35, "どく", "ふゆう", 1.0, 110, "マタドガス", 65, 90, 120, 85, 70, 60, "どく", "ふゆう", 9.5, 111, "サイホーン", 80, 85, 95, 30, 30, 25, "じめん/いわ", "ひらいしん/いしあたま", 115.0, 112, "サイドン", 105, 130, 120, 45, 45, 40, "じめん/いわ", "ひらいしん/いしあたま", 120.0, 113, "ラッキー", 250, 5, 5, 35, 105, 50, "ノーマル", "しぜんかいふく/てんのめぐみ", 34.6, 114, "モンジャラ", 65, 55, 115, 100, 40, 60, "くさ", "ようりょくそ/リーフガード", 35.0, 115, "ガルーラ", 105, 95, 80, 40, 80, 90, "ノーマル", "はやおき/きもったま", 80.0, 116, "タッツー", 30, 40, 70, 70, 25, 60, "みず", "すいすい/スナイパー", 8.0, 117, "シードラ", 55, 65, 95, 95, 45, 85, "みず", "どくのトゲ/スナイパー", 25.0, 118, "トサキント", 45, 67, 60, 35, 50, 63, "みず", "すいすい/みずのベール", 15.0, 119, "アズマオウ", 80, 92, 65, 65, 80, 68, "みず", "すいすい/みずのベール", 39.0, 120, "ヒトデマン", 30, 45, 55, 70, 55, 85, "みず", "はっこう/しぜんかいふく", 34.5, 121, "スターミー", 60, 75, 85, 100, 85, 115, "みず/エスパー", "はっこう/しぜんかいふく", 80.0, 122, "バリヤード", 40, 45, 65, 100, 120, 90, "エスパー", "ぼうおん/フィルター", 54.5, 123, "ストライク", 70, 110, 80, 55, 80, 105, "むし/ひこう", "むしのしらせ/テクニシャン", 56.0, 124, "ルージュラ", 65, 50, 35, 115, 95, 95, "こおり/エスパー", "どんかん/よちむ", 40.6, 125, "エレブー", 65, 83, 57, 95, 85, 105, "でんき", "せいでんき", 30.0, 126, "ブーバー", 65, 95, 57, 100, 85, 93, "ほのお", "ほのおのからだ", 44.5, 127, "カイロス", 65, 125, 100, 55, 70, 85, "むし", "かいりきバサミ/かたやぶり", 55.0, 128, "ケンタロス", 75, 100, 95, 40, 70, 110, "ノーマル", "いかく/いかりのつぼ", 88.4, 129, "コイキング", 20, 10, 55, 15, 20, 80, "みず", "すいすい", 10.0, 130, "ギャラドス", 95, 125, 79, 60, 100, 81, "みず/ひこう", "いかく", 235.0, 131, "ラプラス", 130, 85, 80, 85, 95, 60, "みず/こおり", "ちょすい/シェルアーマー", 220.0, 132, "メタモン", 48, 48, 48, 48, 48, 48, "ノーマル", "じゅうなん", 4.0, 133, "イーブイ", 55, 55, 50, 45, 65, 55, "ノーマル", "にげあし/てきおうりょく", 6.5, 134, "シャワーズ", 130, 65, 60, 110, 95, 65, "みず", "ちょすい", 29.0, 135, "サンダース", 65, 65, 60, 110, 95, 130, "でんき", "ちくでん", 24.5, 136, "ブースター", 65, 130, 60, 95, 110, 65, "ほのお", "もらいび", 25.0, 137, "ポリゴン", 65, 60, 70, 85, 75, 40, "ノーマル", "トレース/ダウンロード", 36.5, 138, "オムナイト", 35, 40, 100, 90, 55, 35, "いわ/みず", "すいすい/シェルアーマー", 7.5, 139, "オムスター", 70, 60, 125, 115, 70, 55, "いわ/みず", "すいすい/シェルアーマー", 35.0, 140, "カブト", 30, 80, 90, 55, 45, 55, "いわ/みず", "すいすい/カブトアーマー", 11.5, 141, "カブトプス", 60, 115, 105, 65, 70, 80, "いわ/みず", "すいすい/カブトアーマー", 40.5, 142, "プテラ", 80, 105, 65, 60, 75, 130, "いわ/ひこう", "いしあたま/プレッシャー", 59.0, 143, "カビゴン", 160, 110, 65, 65, 110, 30, "ノーマル", "めんえき/あついしぼう", 460.0, 144, "フリーザー", 90, 85, 100, 95, 125, 85, "こおり/ひこう", "プレッシャー", 55.4, 145, "サンダー", 90, 90, 85, 125, 90, 100, "でんき/ひこう", "プレッシャー", 52.6, 146, "ファイヤー", 90, 100, 90, 125, 85, 90, "ほのお/ひこう", "プレッシャー", 60.0, 147, "ミニリュウ", 41, 64, 45, 50, 50, 50, "ドラゴン", "だっぴ", 3.3, 148, "ハクリュー", 61, 84, 65, 70, 70, 70, "ドラゴン", "だっぴ", 16.5, 149, "カイリュー", 91, 134, 95, 100, 100, 80, "ドラゴン/ひこう", "せいしんりょく", 210.0, 150, "ミュウツー", 106, 110, 90, 154, 90, 130, "エスパー", "プレッシャー", 122.0, 151, "ミュウ", 100, 100, 100, 100, 100, 100, "エスパー", "シンクロ", 4.0, 152, "チコリータ", 45, 49, 65, 49, 65, 45, "くさ", "しんりょく", 6.4, 153, "ベイリーフ", 60, 62, 80, 63, 80, 60, "くさ", "しんりょく", 15.8, 154, "メガニウム", 80, 82, 100, 83, 100, 80, "くさ", "しんりょく", 100.5, 155, "ヒノアラシ", 39, 52, 43, 60, 50, 65, "ほのお", "もうか", 7.9, 156, "マグマラシ", 58, 64, 58, 80, 65, 80, "ほのお", "もうか", 19.0, 157, "バクフーン", 78, 84, 78, 109, 85, 100, "ほのお", "もうか", 79.5, 158, "ワニノコ", 50, 65, 64, 44, 48, 43, "みず", "げきりゅう", 9.5, 159, "アリゲイツ", 65, 80, 80, 59, 63, 58, "みず", "げきりゅう", 25.0, 160, "オーダイル", 85, 105, 100, 79, 83, 78, "みず", "げきりゅう", 88.8, 161, "オタチ", 35, 46, 34, 35, 45, 20, "ノーマル", "にげあし/するどいめ", 6.0, 162, "オオタチ", 85, 76, 64, 45, 55, 90, "ノーマル", "にげあし/するどいめ", 32.5, 163, "ホーホー", 60, 30, 30, 36, 56, 50, "ノーマル/ひこう", "ふみん/するどいめ", 21.2, 164, "ヨルノズク", 100, 50, 50, 76, 96, 70, "ノーマル/ひこう", "ふみん/するどいめ", 40.8, 165, "レディバ", 40, 20, 30, 40, 80, 55, "むし/ひこう", "むしのしらせ/はやおき", 10.8, 166, "レディアン", 55, 35, 50, 55, 110, 85, "むし/ひこう", "むしのしらせ/はやおき", 35.6, 167, "イトマル", 40, 60, 40, 40, 40, 30, "むし/どく", "むしのしらせ/ふみん", 8.5, 168, "アリアドス", 70, 90, 70, 60, 60, 40, "むし/どく", "むしのしらせ/ふみん", 33.5, 169, "クロバット", 85, 90, 80, 70, 80, 130, "どく/ひこう", "せいしんりょく", 75.0, 170, "チョンチー", 75, 38, 38, 56, 56, 67, "みず/でんき", "ちくでん/はっこう", 12.0, 171, "ランターン", 125, 58, 58, 76, 76, 67, "みず/でんき", "ちくでん/はっこう", 22.5, 172, "ピチュー", 20, 40, 15, 35, 35, 60, "でんき", "せいでんき", 2.0, 173, "ピィ", 50, 25, 28, 45, 55, 15, "ノーマル", "メロメロボディ/マジックガード", 3.0, 174, "ププリン", 90, 30, 15, 40, 20, 15, "ノーマル", "メロメロボディ", 1.0, 175, "トゲピー", 35, 20, 65, 40, 65, 20, "ノーマル", "はりきり/てんのめぐみ", 1.5, 176, "トゲチック", 55, 40, 85, 80, 105, 40, "ノーマル/ひこう", "はりきり/てんのめぐみ", 3.2, 177, "ネイティ", 40, 50, 45, 70, 45, 70, "エスパー/ひこう", "シンクロ/はやおき", 2.0, 178, "ネイティオ", 65, 75, 70, 95, 70, 95, "エスパー/ひこう", "シンクロ/はやおき", 15.0, 179, "メリープ", 55, 40, 40, 65, 45, 35, "でんき", "せいでんき", 7.8, 180, "モココ", 70, 55, 55, 80, 60, 45, "でんき", "せいでんき", 13.3, 181, "デンリュウ", 90, 75, 75, 115, 90, 55, "でんき", "せいでんき", 61.5, 182, "キレイハナ", 75, 80, 85, 90, 100, 50, "くさ", "ようりょくそ", 5.8, 183, "マリル", 70, 20, 50, 20, 50, 40, "みず", "あついしぼう/ちからもち", 8.5, 184, "マリルリ", 100, 50, 80, 50, 80, 50, "みず", "あついしぼう/ちからもち", 28.5, 185, "ウソッキー", 70, 100, 115, 30, 65, 30, "いわ", "がんじょう/いしあたま", 38.0, 186, "ニョロトノ", 90, 75, 75, 90, 100, 70, "みず", "ちょすい/しめりけ", 33.9, 187, "ハネッコ", 35, 35, 40, 35, 55, 50, "くさ/ひこう", "ようりょくそ/リーフガード", 0.5, 188, "ポポッコ", 55, 45, 50, 45, 65, 80, "くさ/ひこう", "ようりょくそ/リーフガード", 1.0, 189, "ワタッコ", 75, 55, 70, 55, 85, 110, "くさ/ひこう", "ようりょくそ/リーフガード", 3.0, 190, "エイパム", 55, 70, 55, 40, 55, 85, "ノーマル", "にげあし/ものひろい", 11.5, 191, "ヒマナッツ", 30, 30, 30, 30, 30, 30, "くさ", "ようりょくそ/サンパワー", 1.8, 192, "キマワリ", 75, 75, 55, 105, 85, 30, "くさ", "ようりょくそ/サンパワー", 8.5, 193, "ヤンヤンマ", 65, 65, 45, 75, 45, 95, "むし/ひこう", "かそく/ふくがん", 38.0, 194, "ウパー", 55, 45, 45, 25, 25, 15, "みず/じめん", "しめりけ/ちょすい", 8.5, 195, "ヌオー", 95, 85, 85, 65, 65, 35, "みず/じめん", "しめりけ/ちょすい", 75.0, 196, "エーフィ", 65, 65, 60, 130, 95, 110, "エスパー", "シンクロ", 26.5, 197, "ブラッキー", 95, 65, 110, 60, 130, 65, "あく", "シンクロ", 27.0, 198, "ヤミカラス", 60, 85, 42, 85, 42, 91, "あく/ひこう", "ふみん/きょううん", 2.1, 199, "ヤドキング", 95, 75, 80, 100, 110, 30, "みず/エスパー", "どんかん/マイペース", 79.5, 200, "ムウマ", 60, 60, 60, 85, 85, 85, "ゴースト", "ふゆう", 1.0, 201, "アンノーン", 48, 72, 48, 72, 48, 48, "エスパー", "ふゆう", 5.0, 202, "ソーナンス", 190, 33, 58, 33, 58, 33, "エスパー", "かげふみ", 28.5, 203, "キリンリキ", 70, 80, 65, 90, 65, 85, "ノーマル/エスパー", "せいしんりょく/はやおき", 41.5, 204, "クヌギダマ", 50, 65, 90, 35, 35, 15, "むし", "がんじょう", 7.2, 205, "フォレトス", 75, 90, 140, 60, 60, 40, "むし/はがね", "がんじょう", 125.8, 206, "ノコッチ", 100, 70, 70, 65, 65, 45, "ノーマル", "てんのめぐみ/にげあし", 14.0, 207, "グライガー", 65, 75, 105, 35, 65, 85, "じめん/ひこう", "かいりきバサミ/すながくれ", 64.8, 208, "ハガネール", 75, 85, 200, 55, 65, 30, "はがね/じめん", "いしあたま/がんじょう", 400.0, 209, "ブルー", 60, 80, 50, 40, 40, 30, "ノーマル", "いかく/にげあし", 7.8, 210, "グランブル", 90, 120, 75, 60, 60, 45, "ノーマル", "いかく/はやあし", 48.7, 211, "ハリーセン", 65, 95, 75, 55, 55, 85, "みず/どく", "どくのトゲ/すいすい", 3.9, 212, "ハッサム", 70, 130, 100, 55, 80, 65, "むし/はがね", "むしのしらせ/テクニシャン", 118.0, 213, "ツボツボ", 20, 10, 230, 10, 230, 5, "むし/いわ", "がんじょう/くいしんぼう", 20.5, 214, "ヘラクロス", 80, 125, 75, 40, 95, 85, "むし/かくとう", "むしのしらせ/こんじょう", 54.0, 215, "ニューラ", 55, 95, 55, 35, 75, 115, "あく/こおり", "せいしんりょく/するどいめ", 28.0, 216, "ヒメグマ", 60, 80, 50, 50, 50, 40, "ノーマル", "ものひろい/はやあし", 8.8, 217, "リングマ", 90, 130, 75, 75, 75, 55, "ノーマル", "こんじょう/はやあし", 125.8, 218, "マグマッグ", 40, 40, 40, 70, 40, 20, "ほのお", "マグマのよろい/ほのおのからだ", 35.0, 219, "マグカルゴ", 50, 50, 120, 80, 80, 30, "ほのお/いわ", "マグマのよろい/ほのおのからだ", 55.0, 220, "ウリムー", 50, 50, 40, 30, 30, 50, "こおり/じめん", "どんかん/ゆきがくれ", 6.5, 221, "イノムー", 100, 100, 80, 60, 60, 50, "こおり/じめん", "どんかん/ゆきがくれ", 55.8, 222, "サニーゴ", 55, 55, 85, 65, 85, 35, "みず/いわ", "はりきり/しぜんかいふく", 5.0, 223, "テッポウオ", 35, 65, 35, 65, 35, 65, "みず", "はりきり/スナイパー", 12.0, 224, "オクタン", 75, 105, 75, 105, 75, 45, "みず", "きゅうばん/スナイパー", 28.5, 225, "デリバード", 45, 55, 45, 65, 45, 75, "こおり/ひこう", "やるき/はりきり", 16.0, 226, "マンタイン", 65, 40, 70, 80, 140, 70, "みず/ひこう", "すいすい/ちょすい", 220.0, 227, "エアームド", 65, 80, 140, 40, 70, 70, "はがね/ひこう", "するどいめ/がんじょう", 50.5, 228, "デルビル", 45, 60, 30, 80, 50, 65, "あく/ほのお", "はやおき/もらいび", 10.8, 229, "ヘルガー", 75, 90, 50, 110, 80, 95, "あく/ほのお", "はやおき/もらいび", 35.0, 230, "キングドラ", 75, 95, 95, 95, 95, 85, "みず/ドラゴン", "すいすい/スナイパー", 152.0, 231, "ゴマゾウ", 90, 60, 60, 40, 40, 40, "じめん", "ものひろい", 33.5, 232, "ドンファン", 90, 120, 120, 60, 60, 50, "じめん", "がんじょう", 120.0, 233, "ポリゴン２", 85, 80, 90, 105, 95, 60, "ノーマル", "トレース/ダウンロード", 32.5, 234, "オドシシ", 73, 95, 62, 85, 65, 85, "ノーマル", "いかく/おみとおし", 71.2, 235, "ドーブル", 55, 20, 35, 20, 45, 75, "ノーマル", "マイペース/テクニシャン", 58.0, 236, "バルキー", 35, 35, 35, 35, 35, 35, "かくとう", "こんじょう/ふくつのこころ", 21.0, 237, "カポエラー", 50, 95, 95, 35, 110, 70, "かくとう", "いかく/テクニシャン", 48.0, 238, "ムチュール", 45, 30, 15, 85, 65, 65, "こおり/エスパー", "どんかん/よちむ", 6.0, 239, "エレキッド", 45, 63, 37, 65, 55, 95, "でんき", "せいでんき", 23.5, 240, "ブビィ", 45, 75, 37, 70, 55, 83, "ほのお", "ほのおのからだ", 21.4, 241, "ミルタンク", 95, 80, 105, 40, 70, 100, "ノーマル", "あついしぼう/きもったま", 75.5, 242, "ハピナス", 255, 10, 10, 75, 135, 55, "ノーマル", "しぜんかいふく/てんのめぐみ", 46.8, 243, "ライコウ", 90, 85, 75, 115, 100, 115, "でんき", "プレッシャー", 178.0, 244, "エンテイ", 115, 115, 85, 90, 75, 100, "ほのお", "プレッシャー", 198.0, 245, "スイクン", 100, 75, 115, 90, 115, 85, "みず", "プレッシャー", 187.0, 246, "ヨーギラス", 50, 64, 50, 45, 50, 41, "いわ/じめん", "こんじょう", 72.0, 247, "サナギラス", 70, 84, 70, 65, 70, 51, "いわ/じめん", "だっぴ", 152.0, 248, "バンギラス", 100, 134, 110, 95, 100, 61, "いわ/あく", "すなおこし", 202.0, 249, "ルギア", 106, 90, 130, 90, 154, 110, "エスパー/ひこう", "プレッシャー", 216.0, 250, "ホウオウ", 106, 130, 90, 110, 154, 90, "ほのお/ひこう", "プレッシャー", 199.0, 251, "セレビィ", 100, 100, 100, 100, 100, 100, "エスパー/くさ", "しぜんかいふく", 5.0, 252, "キモリ", 40, 45, 35, 65, 55, 70, "くさ", "しんりょく", 5.0, 253, "ジュプトル", 50, 65, 45, 85, 65, 95, "くさ", "しんりょく", 21.6, 254, "ジュカイン", 70, 85, 65, 105, 85, 120, "くさ", "しんりょく", 52.2, 255, "アチャモ", 45, 60, 40, 70, 50, 45, "ほのお", "もうか", 2.5, 256, "ワカシャモ", 60, 85, 60, 85, 60, 55, "ほのお/かくとう", "もうか", 19.5, 257, "バシャーモ", 80, 120, 70, 110, 70, 80, "ほのお/かくとう", "もうか", 52.0, 258, "ミズゴロウ", 50, 70, 50, 50, 50, 40, "みず", "げきりゅう", 7.6, 259, "ヌマクロー", 70, 85, 70, 60, 70, 50, "みず/じめん", "げきりゅう", 28.0, 260, "ラグラージ", 100, 110, 90, 85, 90, 60, "みず/じめん", "げきりゅう", 81.9, 261, "ポチエナ", 35, 55, 35, 30, 30, 35, "あく", "にげあし/はやあし", 13.6, 262, "グラエナ", 70, 90, 70, 60, 60, 70, "あく", "にげあし/はやあし", 37.0, 263, "ジグザグマ", 38, 30, 41, 30, 41, 60, "ノーマル", "ものひろい/くいしんぼう", 17.5, 264, "マッスグマ", 78, 70, 61, 50, 61, 100, "ノーマル", "ものひろい/くいしんぼう", 32.5, 265, "ケムッソ", 45, 45, 35, 20, 30, 20, "むし", "りんぷん", 3.6, 266, "カラサリス", 50, 35, 55, 25, 25, 15, "むし", "だっぴ", 10.0, 267, "アゲハント", 60, 70, 50, 90, 50, 65, "むし/ひこう", "むしのしらせ", 28.4, 268, "マユルド", 50, 35, 55, 25, 25, 15, "むし", "だっぴ", 11.5, 269, "ドクケイル", 60, 50, 70, 50, 90, 65, "むし/どく", "りんぷん", 31.6, 270, "ハスボー", 40, 30, 30, 40, 50, 30, "みず/くさ", "すいすい/あめうけざら", 2.6, 271, "ハスブレロ", 60, 50, 50, 60, 70, 50, "みず/くさ", "すいすい/あめうけざら", 32.5, 272, "ルンパッパ", 80, 70, 70, 90, 100, 70, "みず/くさ", "すいすい/あめうけざら", 55.0, 273, "タネボー", 40, 40, 50, 30, 30, 30, "くさ", "ようりょくそ/はやおき", 4.0, 274, "コノハナ", 70, 70, 40, 60, 40, 60, "くさ/あく", "ようりょくそ/はやおき", 28.0, 275, "ダーテング", 90, 100, 60, 90, 60, 80, "くさ/あく", "ようりょくそ/はやおき", 59.6, 276, "スバメ", 40, 55, 30, 30, 30, 85, "ノーマル/ひこう", "こんじょう", 2.3, 277, "オオスバメ", 60, 85, 60, 50, 50, 125, "ノーマル/ひこう", "こんじょう", 19.8, 278, "キャモメ", 40, 30, 30, 55, 30, 85, "みず/ひこう", "するどいめ", 9.5, 279, "ペリッパー", 60, 50, 100, 85, 70, 65, "みず/ひこう", "するどいめ", 28.0, 280, "ラルトス", 28, 25, 25, 45, 35, 40, "エスパー", "シンクロ/トレース", 6.6, 281, "キルリア", 38, 35, 35, 65, 55, 50, "エスパー", "シンクロ/トレース", 20.2, 282, "サーナイト", 68, 65, 65, 125, 115, 80, "エスパー", "シンクロ/トレース", 48.4, 283, "アメタマ", 40, 30, 32, 50, 52, 65, "むし/みず", "すいすい", 1.7, 284, "アメモース", 70, 60, 62, 80, 82, 60, "むし/ひこう", "いかく", 3.6, 285, "キノココ", 60, 40, 60, 40, 60, 35, "くさ", "ほうし/ポイズンヒール", 4.5, 286, "キノガッサ", 60, 130, 80, 60, 60, 70, "くさ/かくとう", "ほうし/ポイズンヒール", 39.2, 287, "ナマケロ", 60, 60, 60, 35, 35, 30, "ノーマル", "なまけ", 24.0, 288, "ヤルキモノ", 80, 80, 80, 55, 55, 90, "ノーマル", "やるき", 46.5, 289, "ケッキング", 150, 160, 100, 95, 65, 100, "ノーマル", "なまけ", 130.5, 290, "ツチニン", 31, 45, 90, 30, 30, 40, "むし/じめん", "ふくがん", 5.5, 291, "テッカニン", 61, 90, 45, 50, 50, 160, "むし/ひこう", "かそく", 12.0, 292, "ヌケニン", 1, 90, 45, 30, 30, 40, "むし/ゴースト", "ふしぎなまもり", 1.2, 293, "ゴニョニョ", 64, 51, 23, 51, 23, 28, "ノーマル", "ぼうおん", 16.3, 294, "ドゴーム", 84, 71, 43, 71, 43, 48, "ノーマル", "ぼうおん", 40.5, 295, "バクオング", 104, 91, 63, 91, 63, 68, "ノーマル", "ぼうおん", 84.0, 296, "マクノシタ", 72, 60, 30, 20, 30, 25, "かくとう", "あついしぼう/こんじょう", 86.4, 297, "ハリテヤマ", 144, 120, 60, 40, 60, 50, "かくとう", "あついしぼう/こんじょう", 253.8, 298, "ルリリ", 50, 20, 40, 20, 40, 20, "ノーマル", "あついしぼう/ちからもち", 2.0, 299, "ノズパス", 30, 45, 135, 45, 90, 30, "いわ", "がんじょう/じりょく", 97.0, 300, "エネコ", 50, 45, 45, 35, 35, 50, "ノーマル", "メロメロボディ/ノーマルスキン", 11.0, 301, "エネコロロ", 70, 65, 65, 55, 55, 70, "ノーマル", "メロメロボディ/ノーマルスキン", 32.6, 302, "ヤミラミ", 50, 75, 75, 65, 65, 50, "あく/ゴースト", "するどいめ/あとだし", 11.0, 303, "クチート", 50, 85, 85, 55, 55, 50, "はがね", "かいりきバサミ/いかく", 11.5, 304, "ココドラ", 50, 70, 100, 40, 40, 30, "はがね/いわ", "がんじょう/いしあたま", 60.0, 305, "コドラ", 60, 90, 140, 50, 50, 40, "はがね/いわ", "がんじょう/いしあたま", 120.0, 306, "ボスゴドラ", 70, 110, 180, 60, 60, 50, "はがね/いわ", "がんじょう/いしあたま", 360.0, 307, "アサナン", 30, 40, 55, 40, 55, 60, "かくとう/エスパー", "ヨガパワー", 11.2, 308, "チャーレム", 60, 60, 75, 60, 75, 80, "かくとう/エスパー", "ヨガパワー", 31.5, 309, "ラクライ", 40, 45, 40, 65, 40, 65, "でんき", "せいでんき/ひらいしん", 15.2, 310, "ライボルト", 70, 75, 60, 105, 60, 105, "でんき", "せいでんき/ひらいしん", 40.2, 311, "プラスル", 60, 50, 40, 85, 75, 95, "でんき", "プラス", 4.2, 312, "マイナン", 60, 40, 50, 75, 85, 95, "でんき", "マイナス", 4.2, 313, "バルビート", 65, 73, 55, 47, 75, 85, "むし", "はっこう/むしのしらせ", 17.7, 314, "イルミーゼ", 65, 47, 55, 73, 75, 85, "むし", "どんかん/いろめがね", 17.7, 315, "ロゼリア", 50, 60, 45, 100, 80, 65, "くさ/どく", "しぜんかいふく/どくのトゲ", 2.0, 316, "ゴクリン", 70, 43, 53, 43, 53, 40, "どく", "ヘドロえき/ねんちゃく", 10.3, 317, "マルノーム", 100, 73, 83, 73, 83, 55, "どく", "ヘドロえき/ねんちゃく", 80.0, 318, "キバニア", 45, 90, 20, 65, 20, 65, "みず/あく", "さめはだ", 20.8, 319, "サメハダー", 70, 120, 40, 95, 40, 95, "みず/あく", "さめはだ", 88.8, 320, "ホエルコ", 130, 70, 35, 70, 35, 60, "みず", "みずのベール/どんかん", 130.0, 321, "ホエルオー", 170, 90, 45, 90, 45, 60, "みず", "みずのベール/どんかん", 398.0, 322, "ドンメル", 60, 60, 40, 65, 45, 35, "ほのお/じめん", "どんかん/たんじゅん", 24.0, 323, "バクーダ", 70, 100, 70, 105, 75, 40, "ほのお/じめん", "マグマのよろい/ハードロック", 220.0, 324, "コータス", 70, 85, 140, 85, 70, 20, "ほのお", "しろいけむり", 80.4, 325, "バネブー", 60, 25, 35, 70, 80, 60, "エスパー", "あついしぼう/マイペース", 30.6, 326, "ブーピッグ", 80, 45, 65, 90, 110, 80, "エスパー", "あついしぼう/マイペース", 71.5, 327, "パッチール", 60, 60, 60, 60, 60, 60, "ノーマル", "マイペース/ちどりあし", 5.0, 328, "ナックラー", 45, 100, 45, 45, 45, 10, "じめん", "かいりきバサミ/ありじごく", 15.0, 329, "ビブラーバ", 50, 70, 50, 50, 50, 70, "じめん/ドラゴン", "ふゆう", 15.3, 330, "フライゴン", 80, 100, 80, 80, 80, 100, "じめん/ドラゴン", "ふゆう", 82.0, 331, "サボネア", 50, 85, 40, 85, 40, 35, "くさ", "すながくれ", 51.3, 332, "ノクタス", 70, 115, 60, 115, 60, 55, "くさ/あく", "すながくれ", 77.4, 333, "チルット", 45, 40, 60, 40, 75, 50, "ノーマル/ひこう", "しぜんかいふく", 1.2, 334, "チルタリス", 75, 70, 90, 70, 105, 80, "ドラゴン/ひこう", "しぜんかいふく", 20.6, 335, "ザングース", 73, 115, 60, 60, 60, 90, "ノーマル", "めんえき", 40.3, 336, "ハブネーク", 73, 100, 60, 100, 60, 65, "どく", "だっぴ", 52.5, 337, "ルナトーン", 70, 55, 65, 95, 85, 70, "いわ/エスパー", "ふゆう", 168.0, 338, "ソルロック", 70, 95, 85, 55, 65, 70, "いわ/エスパー", "ふゆう", 154.0, 339, "ドジョッチ", 50, 48, 43, 46, 41, 60, "みず/じめん", "どんかん/きけんよち", 1.9, 340, "ナマズン", 110, 78, 73, 76, 71, 60, "みず/じめん", "どんかん/きけんよち", 23.6, 341, "ヘイガニ", 43, 80, 65, 50, 35, 35, "みず", "かいりきバサミ/シェルアーマー", 11.5, 342, "シザリガー", 63, 120, 85, 90, 55, 55, "みず/あく", "かいりきバサミ/シェルアーマー", 32.8, 343, "ヤジロン", 40, 40, 55, 40, 70, 55, "じめん/エスパー", "ふゆう", 21.5, 344, "ネンドール", 60, 70, 105, 70, 120, 75, "じめん/エスパー", "ふゆう", 108.0, 345, "リリーラ", 66, 41, 77, 61, 87, 23, "いわ/くさ", "きゅうばん", 23.8, 346, "ユレイドル", 86, 81, 97, 81, 107, 43, "いわ/くさ", "きゅうばん", 60.4, 347, "アノプス", 45, 95, 50, 40, 50, 75, "いわ/むし", "カブトアーマー", 12.5, 348, "アーマルド", 75, 125, 100, 70, 80, 45, "いわ/むし", "カブトアーマー", 68.2, 349, "ヒンバス", 20, 15, 20, 10, 55, 80, "みず", "すいすい", 7.4, 350, "ミロカロス", 95, 60, 79, 100, 125, 81, "みず", "ふしぎなうろこ", 162.0, 351, "ポワルン", 70, 70, 70, 70, 70, 70, "ノーマル", "てんきや", 0.8, 352, "カクレオン", 60, 90, 70, 60, 120, 40, "ノーマル", "へんしょく", 22.0, 353, "カゲボウズ", 44, 75, 35, 63, 33, 45, "ゴースト", "ふみん/おみとおし", 2.3, 354, "ジュペッタ", 64, 115, 65, 83, 63, 65, "ゴースト", "ふみん/おみとおし", 12.5, 355, "ヨマワル", 20, 40, 90, 30, 90, 25, "ゴースト", "ふゆう", 15.0, 356, "サマヨール", 40, 70, 130, 60, 130, 25, "ゴースト", "プレッシャー", 30.6, 357, "トロピウス", 99, 68, 83, 72, 87, 51, "くさ/ひこう", "ようりょくそ/サンパワー", 100.0, 358, "チリーン", 65, 50, 70, 95, 80, 65, "エスパー", "ふゆう", 1.0, 359, "アブソル", 65, 130, 60, 75, 60, 75, "あく", "プレッシャー/きょううん", 47.0, 360, "ソーナノ", 95, 23, 48, 23, 48, 23, "エスパー", "かげふみ", 14.0, 361, "ユキワラシ", 50, 50, 50, 50, 50, 50, "こおり", "せいしんりょく/アイスボティ", 16.8, 362, "オニゴーリ", 80, 80, 80, 80, 80, 80, "こおり", "せいしんりょく/アイスボティ", 256.5, 363, "タマザラシ", 70, 40, 50, 55, 50, 25, "こおり/みず", "あついしぼう/アイスボディ", 39.5, 364, "トドグラー", 90, 60, 70, 75, 70, 45, "こおり/みず", "あついしぼう/アイスボディ", 87.6, 365, "トドゼルガ", 110, 80, 90, 95, 90, 65, "こおり/みず", "あついしぼう/アイスボディ", 150.6, 366, "パールル", 35, 64, 85, 74, 55, 32, "みず", "シェルアーマー", 52.5, 367, "ハンテール", 55, 104, 105, 94, 75, 52, "みず", "すいすい", 27.0, 368, "サクラビス", 55, 84, 105, 114, 75, 52, "みず", "すいすい", 22.6, 369, "ジーランス", 100, 90, 130, 45, 65, 55, "みず/いわ", "すいすい/いしあたま", 23.4, 370, "ラブカス", 43, 30, 55, 40, 65, 97, "みず", "すいすい", 8.7, 371, "タツベイ", 45, 75, 60, 40, 30, 50, "ドラゴン", "いしあたま", 42.1, 372, "コモルー", 65, 95, 100, 60, 50, 50, "ドラゴン", "いしあたま", 110.5, 373, "ボーマンダ", 95, 135, 80, 110, 80, 100, "ドラゴン/ひこう", "いかく", 102.6, 374, "ダンバル", 40, 55, 80, 35, 60, 30, "はがね/エスパー", "クリアボディ", 95.2, 375, "メタング", 60, 75, 100, 55, 80, 50, "はがね/エスパー", "クリアボディ", 202.5, 376, "メタグロス", 80, 135, 130, 95, 90, 70, "はがね/エスパー", "クリアボディ", 550.0, 377, "レジロック", 80, 100, 200, 50, 100, 50, "いわ", "クリアボディ", 230.0, 378, "レジアイス", 80, 50, 100, 100, 200, 50, "こおり", "クリアボディ", 175.0, 379, "レジスチル", 80, 75, 150, 75, 150, 50, "はがね", "クリアボディ", 205.0, 380, "ラティアス", 80, 80, 90, 110, 130, 110, "ドラゴン/エスパー", "ふゆう", 40.0, 381, "ラティオス", 80, 90, 80, 130, 110, 110, "ドラゴン/エスパー", "ふゆう", 60.0, 382, "カイオーガ", 100, 100, 90, 150, 140, 90, "みず", "あめふらし", 352.0, 383, "グラードン", 100, 150, 140, 100, 90, 90, "じめん", "ひでり", 950.0, 384, "レックウザ", 105, 150, 90, 150, 90, 95, "ドラゴン/ひこう", "エアロック", 206.5, 385, "ジラーチ", 100, 100, 100, 100, 100, 100, "はがね/エスパー", "てんのめぐみ", 1.1, 386, "デオキシスN", 50, 150, 50, 150, 50, 150, "エスパー", "プレッシャー", 60.8, 386, "デオキシスA", 50, 180, 20, 180, 20, 150, "エスパー", "プレッシャー", 60.8, 386, "デオキシスD", 50, 70, 160, 70, 160, 90, "エスパー", "プレッシャー", 60.8, 386, "デオキシスS", 50, 95, 90, 95, 90, 180, "エスパー", "プレッシャー", 60.8, 387, "ナエトル", 55, 68, 64, 45, 55, 31, "くさ", "しんりょく", 10.2, 388, "ハヤシガメ", 75, 89, 85, 55, 65, 36, "くさ", "しんりょく", 97.0, 389, "ドダイトス", 95, 109, 105, 75, 85, 56, "くさ/じめん", "しんりょく", 310.0, 390, "ヒコザル", 44, 58, 44, 58, 44, 61, "ほのお", "もうか", 6.2, 391, "モウカザル", 64, 78, 52, 78, 52, 81, "ほのお/かくとう", "もうか", 22.0, 392, "ゴウカザル", 76, 104, 71, 104, 71, 108, "ほのお/かくとう", "もうか", 55.0, 393, "ポッチャマ", 53, 51, 53, 61, 56, 40, "みず", "げきりゅう", 5.2, 394, "ポッタイシ", 64, 66, 68, 81, 76, 50, "みず", "げきりゅう", 23.0, 395, "エンペルト", 84, 86, 88, 111, 101, 60, "みず/はがね", "げきりゅう", 84.5, 396, "ムックル", 40, 55, 30, 30, 30, 60, "ノーマル/ひこう", "するどいめ", 2.0, 397, "ムクバード", 55, 75, 50, 40, 40, 80, "ノーマル/ひこう", "いかく", 15.5, 398, "ムクホーク", 85, 120, 70, 50, 50, 100, "ノーマル/ひこう", "いかく", 24.9, 399, "ビッパ", 59, 45, 40, 35, 40, 31, "ノーマル", "たんじゅう/てんねん", 20.0, 400, "ビーダル", 79, 85, 60, 55, 60, 71, "ノーマル/みず", "たんじゅう/てんねん", 31.5, 401, "コロボーシ", 37, 25, 41, 25, 41, 25, "むし", "だっぴ", 2.2, 402, "コロトック", 77, 85, 51, 55, 51, 65, "むし", "むしのしらせ", 25.5, 403, "コリンク", 45, 65, 34, 40, 34, 45, "でんき", "とうそうしん/いかく", 9.5, 404, "ルクシオ", 60, 85, 49, 60, 49, 60, "でんき", "とうそうしん/いかく", 30.5, 405, "レントラー", 80, 120, 79, 95, 79, 70, "でんき", "とうそうしん/いかく", 42.0, 406, "スボミー", 40, 30, 35, 50, 70, 55, "くさ/どく", "しぜんかいふく/どくのトゲ", 1.2, 407, "ロズレイド", 60, 70, 55, 125, 105, 90, "くさ/どく", "しぜんかいふく/どくのトゲ", 14.5, 408, "ズガイドス", 67, 125, 40, 30, 30, 58, "いわ", "かたやぶり", 31.5, 409, "ラムパルド", 97, 165, 60, 65, 50, 58, "いわ", "かたやぶり", 102.5, 410, "タテトプス", 30, 42, 118, 42, 88, 30, "いわ/はがね", "がんじょう", 57.0, 411, "トリデプス", 60, 52, 168, 47, 138, 30, "いわ/はがね", "がんじょう", 149.5, 412, "ミノムッチ", 40, 29, 45, 29, 45, 36, "むし", "だっぴ", 3.4, 413, "ミノマダム草", 60, 59, 85, 79, 105, 36, "むし/くさ", "きけんよち", 6.5, 413, "ミノマダム地", 60, 79, 105, 59, 85, 36, "むし/じめん", "きけんよち", 6.5, 413, "ミノマダム鋼", 60, 69, 95, 69, 95, 36, "むし/はがね", "きけんよち", 6.5, 414, "ガーメイル", 70, 94, 50, 94, 50, 66, "むし/ひこう", "むしのしらせ", 23.3, 415, "ミツハニー", 30, 30, 42, 30, 42, 70, "むし/ひこう", "みつあつめ", 5.5, 416, "ビークイン", 70, 80, 102, 80, 102, 40, "むし/ひこう", "プレッシャー", 38.5, 417, "パチリス", 60, 45, 70, 45, 90, 95, "でんき", "にげあし/ものひろい", 3.9, 418, "ブイゼル", 55, 65, 35, 60, 30, 85, "みず", "すいすい", 29.5, 419, "フローゼル", 85, 105, 55, 85, 50, 115, "みず", "すいすい", 33.5, 420, "チェリンボ", 45, 35, 45, 62, 53, 35, "くさ", "ようりょくそ", 3.3, 421, "チェリム", 70, 60, 70, 87, 78, 85, "くさ", "フラワーギフト", 9.3, 422, "カラナクシ", 76, 48, 48, 57, 62, 34, "みず", "ねんちゃく/よびみず", 6.3, 423, "トリトドン", 111, 83, 68, 92, 82, 39, "みず/じめん", "ねんちゃく/よびみず", 29.9, 424, "エテボース", 75, 100, 66, 60, 66, 115, "ノーマル", "テクニシャン/ものひろい", 20.3, 425, "フワンテ", 90, 50, 34, 60, 44, 70, "ゴースト/ひこう", "ゆうばく/かるわざ", 1.2, 426, "フワライド", 150, 80, 44, 90, 54, 80, "ゴースト/ひこう", "ゆうばく/かるわざ", 15.0, 427, "ミミロル", 55, 66, 44, 44, 56, 85, "ノーマル", "にげあし/ぶきよう", 5.5, 428, "ミミロップ", 65, 76, 84, 54, 96, 105, "ノーマル", "メロメロボディ/ぶきよう", 33.3, 429, "ムウマージ", 60, 60, 60, 105, 105, 105, "ゴースト", "ふゆう", 4.4, 430, "ドンカラス", 100, 125, 52, 105, 52, 71, "あく/ひこう", "ふみん/きょううん", 27.3, 431, "ニャルマー", 49, 55, 42, 42, 37, 85, "ノーマル", "じゅうなん/マイペース", 3.9, 432, "ブニャット", 71, 82, 64, 64, 59, 112, "ノーマル", "あついしぼう/マイペース", 43.8, 433, "リーシャン", 45, 30, 50, 65, 50, 45, "エスパー", "ふゆう", 0.6, 434, "スカンプー", 63, 63, 47, 41, 41, 74, "どく/あく", "あくしゅう/ゆうばく", 19.2, 435, "スカタンク", 103, 93, 67, 71, 61, 84, "どく/あく", "あくしゅう/ゆうばく", 38.0, 436, "ドーミラー", 57, 24, 86, 24, 86, 23, "はがね/エスパー", "ふゆう/たいねつ", 60.5, 437, "ドータクン", 67, 89, 116, 79, 116, 33, "はがね/エスパー", "ふゆう/たいねつ", 187.0, 438, "ウソハチ", 50, 80, 95, 10, 45, 10, "いわ", "がんじょう/いしあたま", 15.0, 439, "マネネ", 20, 25, 45, 70, 90, 60, "エスパー", "ぼうおん/フィルター", 13.0, 440, "ピンプク", 100, 5, 5, 15, 65, 30, "ノーマル", "しぜんかいふく/てんのめぐみ", 24.4, 441, "ペラップ", 76, 65, 45, 92, 42, 91, "ノーマル/ひこう", "するどいめ/ちどりあし", 1.9, 442, "ミカルゲ", 50, 92, 108, 92, 108, 35, "ゴースト/あく", "プレッシャー", 108.0, 443, "フカマル", 58, 70, 45, 40, 45, 42, "ドラゴン/じめん", "すながくれ", 20.5, 444, "ガバイト", 68, 90, 65, 50, 55, 82, "ドラゴン/じめん", "すながくれ", 56.0, 445, "ガブリアス", 108, 130, 95, 80, 85, 102, "ドラゴン/じめん", "すながくれ", 95.0, 446, "ゴンベ", 135, 85, 40, 40, 85, 5, "ノーマル", "ものひろい/あついしぼう", 105.0, 447, "リオル", 40, 70, 40, 35, 40, 60, "かくとう", "ふくつのこころ/せいしんりょく", 20.2, 448, "ルカリオ", 70, 110, 70, 115, 70, 90, "かくとう/はがね", "ふくつのこころ/せいしんりょく", 54.0, 449, "ヒポポタス", 68, 72, 78, 38, 42, 32, "じめん", "すなおこし", 49.5, 450, "カバルドン", 108, 112, 118, 68, 72, 47, "じめん", "すなおこし", 300.0, 451, "スコルピ", 40, 50, 90, 30, 55, 65, "どく/むし", "カブトアーマー/スナイパー", 12.0, 452, "ドラピオン", 70, 90, 110, 60, 75, 95, "どく/あく", "カブトアーマー/スナイパー", 61.5, 453, "グレッグル", 48, 61, 40, 61, 40, 50, "どく/かくとう", "きけんよち/かんそうはだ", 23.0, 454, "ドクロッグ", 83, 106, 65, 86, 65, 85, "どく/かくとう", "きけんよち/かんそうはだ", 44.4, 455, "マスキッパ", 74, 100, 72, 90, 72, 46, "くさ", "ふゆう", 27.0, 456, "ケイコウオ", 49, 49, 56, 49, 61, 66, "みず", "すいすい/よびみず", 7.0, 457, "ネオラント", 69, 69, 76, 69, 86, 91, "みず", "すいすい/よびみず", 24.0, 458, "タマンタ", 45, 20, 50, 60, 120, 50, "みず/ひこう", "すいすい/ちょすい", 65.0, 459, "ユキカブリ", 60, 62, 50, 62, 60, 40, "くさ/こおり", "ゆきふらし", 50.5, 460, "ユキノオー", 90, 92, 75, 92, 85, 60, "くさ/こおり", "ゆきふらし", 135.5, 461, "マニューラ", 70, 120, 65, 45, 85, 125, "あく/こおり", "プレッシャー", 34.0, 462, "ジバコイル", 70, 70, 115, 130, 90, 60, "でんき/はがね", "じりょく/がんじょう", 180.0, 463, "ベロベルト", 110, 85, 95, 80, 95, 50, "ノーマル", "マイペース/どんかん", 140.0, 464, "ドサイドン", 115, 140, 130, 55, 55, 40, "じめん/いわ", "ひらいしん/ハードロック", 282.8, 465, "モジャンボ", 100, 100, 125, 110, 50, 50, "くさ", "ようりょくそ/リーフガード", 128.6, 466, "エレキブル", 75, 123, 67, 95, 85, 95, "でんき", "でんきエンジン", 138.6, 467, "ブーバーン", 75, 95, 67, 125, 95, 83, "ほのお", "ほのおのからだ", 68.0, 468, "トゲキッス", 85, 50, 95, 120, 115, 80, "ノーマル/ひこう", "はりきり/てんのめぐみ", 38.0, 469, "メガヤンマ", 86, 76, 86, 116, 56, 95, "むし/ひこう", "かそく/いろめがね", 51.5, 470, "リーフィア", 65, 110, 130, 60, 65, 95, "くさ", "リーフガード", 25.5, 471, "グレイシア", 65, 60, 110, 130, 95, 65, "こおり", "ゆきがくれ", 25.9, 472, "グライオン", 75, 95, 125, 45, 75, 95, "じめん/ひこう", "かいりきバサミ/すながくれ", 42.5, 473, "マンムー", 110, 130, 80, 70, 60, 80, "こおり/じめん", "どんかん/ゆきがくれ", 291.0, 474, "ポリゴンＺ", 85, 80, 70, 135, 75, 90, "ノーマル", "てきおうりょく/ダウンロード", 34.0, 475, "エルレイド", 68, 125, 65, 65, 115, 80, "エスパー/かくとう", "ふくつのこころ", 52.0, 476, "ダイノーズ", 60, 55, 145, 75, 150, 40, "いわ/はがね", "がんじょう/じりょく", 340.0, 477, "ヨノワール", 45, 100, 135, 65, 135, 45, "ゴースト", "プレッシャー", 106.6, 478, "ユキメノコ", 70, 80, 70, 80, 70, 110, "こおり/ゴースト", "ゆきがくれ", 26.6, 479, "ロトム", 50, 50, 77, 95, 77, 91, "でんき/ゴースト", "ふゆう", 0.3, 479, "ロトムFC", 50, 65, 107, 105, 107, 86, "でんき/ゴースト", "ふゆう", 0.3, 480, "ユクシー", 75, 75, 130, 75, 130, 95, "エスパー", "ふゆう", 0.3, 481, "エムリット", 80, 105, 105, 105, 105, 80, "エスパー", "ふゆう", 0.3, 482, "アグノム", 75, 125, 70, 125, 70, 115, "エスパー", "ふゆう", 0.3, 483, "ディアルガ", 100, 120, 120, 150, 100, 90, "はがね/ドラゴン", "プレッシャー", 683.0, 484, "パルキア", 90, 120, 100, 150, 120, 100, "みず/ドラゴン", "プレッシャー", 336.0, 485, "ヒードラン", 91, 90, 106, 130, 106, 77, "ほのお/はがね", "もらいび", 430.0, 486, "レジギガス", 110, 160, 110, 80, 110, 100, "ノーマル", "スロースタート", 420.0, 487, "ギラティナA", 150, 100, 120, 100, 120, 90, "ゴースト/ドラゴン", "プレッシャー", 750.0, 487, "ギラティナO", 150, 120, 100, 120, 100, 90, "ゴースト/ドラゴン", "ふゆう", 650.0, 488, "クレセリア", 120, 70, 120, 75, 130, 85, "エスパー", "ふゆう", 85.6, 489, "フィオネ", 80, 80, 80, 80, 80, 80, "みず", "うるおいボディ", 3.1, 490, "マナフィ", 100, 100, 100, 100, 100, 100, "みず", "うるおいボディ", 1.4, 491, "ダークライ", 70, 90, 90, 135, 90, 125, "あく", "ナイトメア", 50.5, 492, "シェイミL", 100, 100, 100, 100, 100, 100, "くさ", "しぜんかいふく", 2.1, 492, "シェイミS", 100, 103, 75, 120, 75, 127, "くさ/ひこう", "てんのめぐみ", 5.2, 493, "アルセウス", 120, 120, 120, 120, 120, 120, "ノーマル", "マルチタイプ", 320.0}
    Private Sub Form1_Load(sender As Object, e As EventArgs) Handles MyBase.Load
        'フォーム内
        Pokemon.SelectedIndex = 0
        Nature.SelectedIndex = 0
        Characteristic.SelectedIndex = 0
        Hidden_Power.SelectedIndex = 0
    End Sub


    '====================================================================================================================================================================

    ' 各種入力

    '====================================================================================================================================================================

    '--- レベル ---
    Private Sub Level_KeyPress(sender As Object, e As KeyPressEventArgs) Handles Level.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub Level_TextChanged(sender As Object, e As EventArgs) Handles Level.TextChanged
        If ("" <> Level.Text) Then
            If (100 <= Level.Text) Then
                Level.Text = 100
                Level.SelectionStart = 3
            End If
            If (0 = Level.Text) Then
                Level.Text = 1
                Level.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub Level_Plus_Click(sender As Object, e As EventArgs) Handles Level_Plus.Click
        Level.Text = Plus(Level.Text)
    End Sub

    Private Sub Level_Minus_Click(sender As Object, e As EventArgs) Handles Level_Minus.Click
        Level.Text = Minus(Level.Text)
    End Sub

    Private Sub Level_5_Click(sender As Object, e As EventArgs) Handles Level_5.Click
        Level.Text = 5
    End Sub

    Private Sub Level_50_Click(sender As Object, e As EventArgs) Handles Level_50.Click
        Level.Text = 50
    End Sub

    Private Sub Level_100_Click(sender As Object, e As EventArgs) Handles Level_100.Click
        Level.Text = 100
    End Sub


    '=== HP ===
    'HP RSs
    Private Sub HP_RSs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles HP_RSs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub HP_RSs_TextChanged(sender As Object, e As EventArgs) Handles HP_RSs.TextChanged
        If ("" <> HP_RSs.Text) Then
            If (999 <= HP_RSs.Text) Then
                HP_RSs.Text = 999
                HP_RSs.SelectionStart = 3
            End If
            If (0 >= HP_RSs.Text) Then
                HP_RSs.Text = 1
                HP_RSs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub HP_RSs_Plus_Click(sender As Object, e As EventArgs) Handles HP_RSs_Plus.Click
        HP_RSs.Text = Plus(HP_RSs.Text)
    End Sub

    Private Sub HP_RSs_Minus_Click(sender As Object, e As EventArgs) Handles HP_RSs_Minus.Click
        HP_RSs.Text = Minus(HP_RSs.Text)
    End Sub

    'HP EVs
    Private Sub HP_EVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles HP_EVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub HP_EVs_TextChanged(sender As Object, e As EventArgs) Handles HP_EVs.TextChanged
        If ("" <> HP_EVs.Text) Then
            If (252 <= HP_EVs.Text) Then
                HP_EVs.Text = 252
                HP_EVs.SelectionStart = 3
            End If
            If (0 >= HP_EVs.Text) Then
                HP_EVs.Text = 0
                HP_EVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub HP_EVs_Plus_Click(sender As Object, e As EventArgs) Handles HP_EVs_Plus.Click
        HP_EVs.Text = Plus(HP_EVs.Text)
    End Sub

    Private Sub HP_EVs_Minus_Click(sender As Object, e As EventArgs) Handles HP_EVs_Minus.Click
        HP_EVs.Text = Minus(HP_EVs.Text)
    End Sub

    Private Sub HP_EVs_0_Click(sender As Object, e As EventArgs) Handles HP_EVs_0.Click
        HP_EVs.Text = 0
    End Sub

    Private Sub HP_EVs_252_Click(sender As Object, e As EventArgs) Handles HP_EVs_252.Click
        HP_EVs.Text = 252
    End Sub

    'HP IVs
    Private Sub HP_IVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles HP_IVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub HP_IVs_TextChanged(sender As Object, e As EventArgs) Handles HP_IVs.TextChanged
        If ("" <> HP_IVs.Text) Then
            If (31 <= HP_IVs.Text) Then
                HP_IVs.Text = 31
                HP_IVs.SelectionStart = 3
            End If
            If (0 >= HP_IVs.Text) Then
                HP_IVs.Text = 0
                HP_IVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub HP_IVs_Plus_Click(sender As Object, e As EventArgs) Handles HP_IVs_Plus.Click
        HP_IVs.Text = Plus(HP_IVs.Text)
    End Sub

    Private Sub HP_IVs_Minus_Click(sender As Object, e As EventArgs) Handles HP_IVs_Minus.Click
        HP_IVs.Text = Minus(HP_IVs.Text)
    End Sub

    Private Sub HP_IVs_0_Click(sender As Object, e As EventArgs) Handles HP_IVs_0.Click
        HP_IVs.Text = 0
    End Sub

    Private Sub HP_IVs_31_Click(sender As Object, e As EventArgs) Handles HP_IVs_31.Click
        HP_IVs.Text = 252
    End Sub


    '=== A ===
    'A RSs
    Private Sub A_RSs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles A_RSs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub A_RSs_TextChanged(sender As Object, e As EventArgs) Handles A_RSs.TextChanged
        If ("" <> A_RSs.Text) Then
            If (999 <= A_RSs.Text) Then
                A_RSs.Text = 999
                A_RSs.SelectionStart = 3
            End If
            If (0 >= A_RSs.Text) Then
                A_RSs.Text = 1
                A_RSs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub A_RSs_Plus_Click(sender As Object, e As EventArgs) Handles A_RSs_Plus.Click
        A_RSs.Text = Plus(A_RSs.Text)
    End Sub

    Private Sub A_RSs_Minus_Click(sender As Object, e As EventArgs) Handles A_RSs_Minus.Click
        A_RSs.Text = Minus(A_RSs.Text)
    End Sub

    'A EVs
    Private Sub A_EVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles A_EVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub A_EVs_TextChanged(sender As Object, e As EventArgs) Handles A_EVs.TextChanged
        If ("" <> A_EVs.Text) Then
            If (252 <= A_EVs.Text) Then
                A_EVs.Text = 252
                A_EVs.SelectionStart = 3
            End If
            If (0 >= A_EVs.Text) Then
                A_EVs.Text = 0
                A_EVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub A_EVs_Plus_Click(sender As Object, e As EventArgs) Handles A_EVs_Plus.Click
        A_EVs.Text = Plus(A_EVs.Text)
    End Sub

    Private Sub A_EVs_Minus_Click(sender As Object, e As EventArgs) Handles A_EVs_Minus.Click
        A_EVs.Text = Minus(A_EVs.Text)
    End Sub

    Private Sub A_EVs_0_Click(sender As Object, e As EventArgs) Handles A_EVs_0.Click
        A_EVs.Text = 0
    End Sub

    Private Sub A_EVs_252_Click(sender As Object, e As EventArgs) Handles A_EVs_252.Click
        A_EVs.Text = 252
    End Sub

    'A IVs
    Private Sub A_IVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles A_IVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub A_IVs_TextChanged(sender As Object, e As EventArgs) Handles A_IVs.TextChanged
        If ("" <> A_IVs.Text) Then
            If (31 <= A_IVs.Text) Then
                A_IVs.Text = 31
                A_IVs.SelectionStart = 3
            End If
            If (0 >= A_IVs.Text) Then
                A_IVs.Text = 0
                A_IVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub A_IVs_Plus_Click(sender As Object, e As EventArgs) Handles A_IVs_Plus.Click
        A_IVs.Text = Plus(A_IVs.Text)
    End Sub

    Private Sub A_IVs_Minus_Click(sender As Object, e As EventArgs) Handles A_IVs_Minus.Click
        A_IVs.Text = Minus(A_IVs.Text)
    End Sub

    Private Sub A_IVs_0_Click(sender As Object, e As EventArgs) Handles A_IVs_0.Click
        A_IVs.Text = 0
    End Sub

    Private Sub A_IVs_31_Click(sender As Object, e As EventArgs) Handles A_IVs_31.Click
        A_IVs.Text = 252
    End Sub


    '=== B ===
    'B RSs
    Private Sub B_RSs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles B_RSs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub B_RSs_TextChanged(sender As Object, e As EventArgs) Handles B_RSs.TextChanged
        If ("" <> B_RSs.Text) Then
            If (999 <= B_RSs.Text) Then
                B_RSs.Text = 999
                B_RSs.SelectionStart = 3
            End If
            If (0 >= B_RSs.Text) Then
                B_RSs.Text = 1
                B_RSs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub B_RSs_Plus_Click(sender As Object, e As EventArgs) Handles B_RSs_Plus.Click
        B_RSs.Text = Plus(B_RSs.Text)
    End Sub

    Private Sub B_RSs_Minus_Click(sender As Object, e As EventArgs) Handles B_RSs_Minus.Click
        B_RSs.Text = Minus(B_RSs.Text)
    End Sub

    'B EVs
    Private Sub B_EVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles B_EVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub B_EVs_TextChanged(sender As Object, e As EventArgs) Handles B_EVs.TextChanged
        If ("" <> B_EVs.Text) Then
            If (252 <= B_EVs.Text) Then
                B_EVs.Text = 252
                B_EVs.SelectionStart = 3
            End If
            If (0 >= B_EVs.Text) Then
                B_EVs.Text = 0
                B_EVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub B_EVs_Plus_Click(sender As Object, e As EventArgs) Handles B_EVs_Plus.Click
        B_EVs.Text = Plus(B_EVs.Text)
    End Sub

    Private Sub B_EVs_Minus_Click(sender As Object, e As EventArgs) Handles B_EVs_Minus.Click
        B_EVs.Text = Minus(B_EVs.Text)
    End Sub

    Private Sub B_EVs_0_Click(sender As Object, e As EventArgs) Handles B_EVs_0.Click
        B_EVs.Text = 0
    End Sub

    Private Sub B_EVs_252_Click(sender As Object, e As EventArgs) Handles B_EVs_252.Click
        B_EVs.Text = 252
    End Sub

    'B IVs
    Private Sub B_IVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles B_IVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub B_IVs_TextChanged(sender As Object, e As EventArgs) Handles B_IVs.TextChanged
        If ("" <> B_IVs.Text) Then
            If (31 <= B_IVs.Text) Then
                B_IVs.Text = 31
                B_IVs.SelectionStart = 3
            End If
            If (0 >= B_IVs.Text) Then
                B_IVs.Text = 0
                B_IVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub B_IVs_Plus_Click(sender As Object, e As EventArgs) Handles B_IVs_Plus.Click
        B_IVs.Text = Plus(B_IVs.Text)
    End Sub

    Private Sub B_IVs_Minus_Click(sender As Object, e As EventArgs) Handles B_IVs_Minus.Click
        B_IVs.Text = Minus(B_IVs.Text)
    End Sub

    Private Sub B_IVs_0_Click(sender As Object, e As EventArgs) Handles B_IVs_0.Click
        B_IVs.Text = 0
    End Sub

    Private Sub B_IVs_31_Click(sender As Object, e As EventArgs) Handles B_IVs_31.Click
        B_IVs.Text = 252
    End Sub


    '=== C ===
    'C RSs
    Private Sub C_RSs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles C_RSs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub C_RSs_TextChanged(sender As Object, e As EventArgs) Handles C_RSs.TextChanged
        If ("" <> C_RSs.Text) Then
            If (999 <= C_RSs.Text) Then
                C_RSs.Text = 999
                C_RSs.SelectionStart = 3
            End If
            If (0 >= C_RSs.Text) Then
                C_RSs.Text = 1
                C_RSs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub C_RSs_Plus_Click(sender As Object, e As EventArgs) Handles C_RSs_Plus.Click
        C_RSs.Text = Plus(C_RSs.Text)
    End Sub

    Private Sub C_RSs_Minus_Click(sender As Object, e As EventArgs) Handles C_RSs_Minus.Click
        C_RSs.Text = Minus(C_RSs.Text)
    End Sub

    'C EVs
    Private Sub C_EVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles C_EVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub C_EVs_TextChanged(sender As Object, e As EventArgs) Handles C_EVs.TextChanged
        If ("" <> C_EVs.Text) Then
            If (252 <= C_EVs.Text) Then
                C_EVs.Text = 252
                C_EVs.SelectionStart = 3
            End If
            If (0 >= C_EVs.Text) Then
                C_EVs.Text = 0
                C_EVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub C_EVs_Plus_Click(sender As Object, e As EventArgs) Handles C_EVs_Plus.Click
        C_EVs.Text = Plus(C_EVs.Text)
    End Sub

    Private Sub C_EVs_Minus_Click(sender As Object, e As EventArgs) Handles C_EVs_Minus.Click
        C_EVs.Text = Minus(C_EVs.Text)
    End Sub

    Private Sub C_EVs_0_Click(sender As Object, e As EventArgs) Handles C_EVs_0.Click
        C_EVs.Text = 0
    End Sub

    Private Sub C_EVs_252_Click(sender As Object, e As EventArgs) Handles C_EVs_252.Click
        C_EVs.Text = 252
    End Sub

    'C IVs
    Private Sub C_IVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles C_IVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub C_IVs_TextChanged(sender As Object, e As EventArgs) Handles C_IVs.TextChanged
        If ("" <> C_IVs.Text) Then
            If (31 <= C_IVs.Text) Then
                C_IVs.Text = 31
                C_IVs.SelectionStart = 3
            End If
            If (0 >= C_IVs.Text) Then
                C_IVs.Text = 0
                C_IVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub C_IVs_Plus_Click(sender As Object, e As EventArgs) Handles C_IVs_Plus.Click
        C_IVs.Text = Plus(C_IVs.Text)
    End Sub

    Private Sub C_IVs_Minus_Click(sender As Object, e As EventArgs) Handles C_IVs_Minus.Click
        C_IVs.Text = Minus(C_IVs.Text)
    End Sub

    Private Sub C_IVs_0_Click(sender As Object, e As EventArgs) Handles C_IVs_0.Click
        C_IVs.Text = 0
    End Sub

    Private Sub C_IVs_31_Click(sender As Object, e As EventArgs) Handles C_IVs_31.Click
        C_IVs.Text = 252
    End Sub


    '=== D ===
    'D RSs
    Private Sub D_RSs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles D_RSs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub D_RSs_TextChanged(sender As Object, e As EventArgs) Handles D_RSs.TextChanged
        If ("" <> D_RSs.Text) Then
            If (999 <= D_RSs.Text) Then
                D_RSs.Text = 999
                D_RSs.SelectionStart = 3
            End If
            If (0 >= D_RSs.Text) Then
                D_RSs.Text = 1
                D_RSs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub D_RSs_Plus_Click(sender As Object, e As EventArgs) Handles D_RSs_Plus.Click
        D_RSs.Text = Plus(D_RSs.Text)
    End Sub

    Private Sub D_RSs_Minus_Click(sender As Object, e As EventArgs) Handles D_RSs_Minus.Click
        D_RSs.Text = Minus(D_RSs.Text)
    End Sub

    'D EVs
    Private Sub D_EVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles D_EVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub D_EVs_TextChanged(sender As Object, e As EventArgs) Handles D_EVs.TextChanged
        If ("" <> D_EVs.Text) Then
            If (252 <= D_EVs.Text) Then
                D_EVs.Text = 252
                D_EVs.SelectionStart = 3
            End If
            If (0 >= D_EVs.Text) Then
                D_EVs.Text = 0
                D_EVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub D_EVs_Plus_Click(sender As Object, e As EventArgs) Handles D_EVs_Plus.Click
        D_EVs.Text = Plus(D_EVs.Text)
    End Sub

    Private Sub D_EVs_Minus_Click(sender As Object, e As EventArgs) Handles D_EVs_Minus.Click
        D_EVs.Text = Minus(D_EVs.Text)
    End Sub

    Private Sub D_EVs_0_Click(sender As Object, e As EventArgs) Handles D_EVs_0.Click
        D_EVs.Text = 0
    End Sub

    Private Sub D_EVs_252_Click(sender As Object, e As EventArgs) Handles D_EVs_252.Click
        D_EVs.Text = 252
    End Sub

    'D IVs
    Private Sub D_IVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles D_IVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub D_IVs_TextChanged(sender As Object, e As EventArgs) Handles D_IVs.TextChanged
        If ("" <> D_IVs.Text) Then
            If (31 <= D_IVs.Text) Then
                D_IVs.Text = 31
                D_IVs.SelectionStart = 3
            End If
            If (0 >= D_IVs.Text) Then
                D_IVs.Text = 0
                D_IVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub D_IVs_Plus_Click(sender As Object, e As EventArgs) Handles D_IVs_Plus.Click
        D_IVs.Text = Plus(D_IVs.Text)
    End Sub

    Private Sub D_IVs_Minus_Click(sender As Object, e As EventArgs) Handles D_IVs_Minus.Click
        D_IVs.Text = Minus(D_IVs.Text)
    End Sub

    Private Sub D_IVs_0_Click(sender As Object, e As EventArgs) Handles D_IVs_0.Click
        D_IVs.Text = 0
    End Sub

    Private Sub D_IVs_31_Click(sender As Object, e As EventArgs) Handles D_IVs_31.Click
        D_IVs.Text = 252
    End Sub


    '=== S ===
    'S RSs
    Private Sub S_RSs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles S_RSs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub S_RSs_TextChanged(sender As Object, e As EventArgs) Handles S_RSs.TextChanged
        If ("" <> S_RSs.Text) Then
            If (999 <= S_RSs.Text) Then
                S_RSs.Text = 999
                S_RSs.SelectionStart = 3
            End If
            If (0 >= S_RSs.Text) Then
                S_RSs.Text = 1
                S_RSs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub S_RSs_Plus_Click(sender As Object, e As EventArgs) Handles S_RSs_Plus.Click
        S_RSs.Text = Plus(S_RSs.Text)
    End Sub

    Private Sub S_RSs_Minus_Click(sender As Object, e As EventArgs) Handles S_RSs_Minus.Click
        S_RSs.Text = Minus(S_RSs.Text)
    End Sub

    'S EVs
    Private Sub S_EVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles S_EVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub S_EVs_TextChanged(sender As Object, e As EventArgs) Handles S_EVs.TextChanged
        If ("" <> S_EVs.Text) Then
            If (252 <= S_EVs.Text) Then
                S_EVs.Text = 252
                S_EVs.SelectionStart = 3
            End If
            If (0 >= S_EVs.Text) Then
                S_EVs.Text = 0
                S_EVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub S_EVs_Plus_Click(sender As Object, e As EventArgs) Handles S_EVs_Plus.Click
        S_EVs.Text = Plus(S_EVs.Text)
    End Sub

    Private Sub S_EVs_Minus_Click(sender As Object, e As EventArgs) Handles S_EVs_Minus.Click
        S_EVs.Text = Minus(S_EVs.Text)
    End Sub

    Private Sub S_EVs_0_Click(sender As Object, e As EventArgs) Handles S_EVs_0.Click
        S_EVs.Text = 0
    End Sub

    Private Sub S_EVs_252_Click(sender As Object, e As EventArgs) Handles S_EVs_252.Click
        S_EVs.Text = 252
    End Sub

    'S IVs
    Private Sub S_IVs_KeyPress(sender As Object, e As KeyPressEventArgs) Handles S_IVs.KeyPress
        If Not (("0"c <= e.KeyChar And e.KeyChar <= "9"c) Or e.KeyChar = ControlChars.Back) Then e.Handled = True
    End Sub

    Private Sub S_IVs_TextChanged(sender As Object, e As EventArgs) Handles S_IVs.TextChanged
        If ("" <> S_IVs.Text) Then
            If (31 <= S_IVs.Text) Then
                S_IVs.Text = 31
                S_IVs.SelectionStart = 3
            End If
            If (0 >= S_IVs.Text) Then
                S_IVs.Text = 0
                S_IVs.SelectionStart = 1
            End If
        End If
    End Sub

    Private Sub S_IVs_Plus_Click(sender As Object, e As EventArgs) Handles S_IVs_Plus.Click
        S_IVs.Text = Plus(S_IVs.Text)
    End Sub

    Private Sub S_IVs_Minus_Click(sender As Object, e As EventArgs) Handles S_IVs_Minus.Click
        S_IVs.Text = Minus(S_IVs.Text)
    End Sub

    Private Sub S_IVs_0_Click(sender As Object, e As EventArgs) Handles S_IVs_0.Click
        S_IVs.Text = 0
    End Sub

    Private Sub S_IVs_31_Click(sender As Object, e As EventArgs) Handles S_IVs_31.Click
        S_IVs.Text = 252
    End Sub

    '====================================================================================================================================================================

    '計算

    '====================================================================================================================================================================

    Private Sub Calculation_Click(sender As Object, e As EventArgs) Handles Calculation.Click

        '可能性のあるめざパのリセット
        Calced_Power_and_Type.Items.Clear()
        Calced_Power_and_Type.Update()

        'ポケモンデータの取得
        Dim Name_Index As Integer = Array.IndexOf(Pokemon_Basics, Pokemon.Text)
        Calced_Pokemon.Text = Pokemon_Basics(Name_Index)
        Calced_Pokemon.Update()
        Dim BSs(5) As Integer
        For L = 0 To 5
            BSs(L) = Pokemon_Basics(Name_Index + L + 1)
        Next


        '可能性のある個体値の最小値と最大値を求める
        If (Level.Text = "") Then Level.Text = 1

        If (HP_RSs.Text = "") Then HP_RSs.Text = 0
        If (HP_EVs.Text = "") Then HP_EVs.Text = 0

        If (A_RSs.Text = "") Then A_RSs.Text = 0
        If (A_EVs.Text = "") Then A_EVs.Text = 0

        If (B_RSs.Text = "") Then B_RSs.Text = 0
        If (B_EVs.Text = "") Then B_EVs.Text = 0

        If (C_RSs.Text = "") Then C_RSs.Text = 0
        If (C_EVs.Text = "") Then C_EVs.Text = 0

        If (D_RSs.Text = "") Then D_RSs.Text = 0
        If (D_EVs.Text = "") Then D_EVs.Text = 0

        If (S_RSs.Text = "") Then S_RSs.Text = 0
        If (S_EVs.Text = "") Then S_EVs.Text = 0


        '変数代入
        Dim Type_Total As Integer = 0
        Dim Power_Total As Integer = 0
        Dim Lv As Integer = Level.Text
        Dim RSs() As Integer = {HP_RSs.Text, A_RSs.Text, B_RSs.Text, C_RSs.Text, D_RSs.Text, S_RSs.Text}
        Dim EVs() As Integer = {HP_EVs.Text, A_EVs.Text, B_EVs.Text, C_EVs.Text, D_EVs.Text, S_EVs.Text}
        Dim IVs_MimMax() As Integer = {99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99, 99} 'HP最小, HP最大, A最小, A最大...
        Dim Nature_revise() As Double = {1, 1, 1, 1, 1}


        '努力値警告
        If (510 <= EVs(0) + EVs(1) + EVs(2) + EVs(3) + EVs(4) + EVs(5)) Then
            If MessageBox.Show("努力値の合計が510を超えていますが、この状態で計算しますか？", "努力値が不正です", MessageBoxButtons.YesNo, MessageBoxIcon.Exclamation) = DialogResult.No Then Exit Sub
        End If


        '性格補正の適応
        For L = 0 To 4
            Nature_revise(L) = Nature_Conversion(Nature.Text)(L)
        Next


        '可能性のある個体値の最小値と最大値を求める
        If (HP_IVs_Enabled.Checked = False) Then
            For L = 0 To 31
                If (HP_Real_Value(BSs(0), L, EVs(0), Lv) = RSs(0)) Then
                    IVs_MimMax(0) = Math.Min(IVs_MimMax(0), L)
                    IVs_MimMax(1) = Math.Max(IVs_MimMax(0), L)
                End If
            Next
        Else
            IVs_MimMax(0) = HP_IVs.Text
            IVs_MimMax(1) = HP_IVs.Text
        End If

        If (A_IVs_Enabled.Checked = False) Then
            For L = 0 To 31
                If (A_S_Real_Value(BSs(1), L, EVs(1), Lv, Nature_revise(0)) = RSs(1)) Then
                    IVs_MimMax(2) = Math.Min(IVs_MimMax(2), L)
                    IVs_MimMax(3) = Math.Max(IVs_MimMax(2), L)
                End If
            Next
        Else
            IVs_MimMax(2) = A_IVs.Text
            IVs_MimMax(3) = A_IVs.Text
        End If

        If (B_IVs_Enabled.Checked = False) Then
            For L = 0 To 31
                If (A_S_Real_Value(BSs(2), L, EVs(2), Lv, Nature_revise(1)) = RSs(2)) Then
                    IVs_MimMax(4) = Math.Min(IVs_MimMax(4), L)
                    IVs_MimMax(5) = Math.Max(IVs_MimMax(4), L)
                End If
            Next
        Else
            IVs_MimMax(4) = B_IVs.Text
            IVs_MimMax(5) = B_IVs.Text
        End If

        If (C_IVs_Enabled.Checked = False) Then
            For L = 0 To 31
                If (A_S_Real_Value(BSs(3), L, EVs(3), Lv, Nature_revise(2)) = RSs(3)) Then
                    IVs_MimMax(6) = Math.Min(IVs_MimMax(6), L)
                    IVs_MimMax(7) = Math.Max(IVs_MimMax(6), L)
                End If
            Next
        Else
            IVs_MimMax(6) = C_IVs.Text
            IVs_MimMax(7) = C_IVs.Text
        End If

        If (D_IVs_Enabled.Checked = False) Then
            For L = 0 To 31
                If (A_S_Real_Value(BSs(4), L, EVs(4), Lv, Nature_revise(3)) = RSs(4)) Then
                    IVs_MimMax(8) = Math.Min(IVs_MimMax(8), L)
                    IVs_MimMax(9) = Math.Max(IVs_MimMax(8), L)
                End If
            Next
        Else
            IVs_MimMax(8) = D_IVs.Text
            IVs_MimMax(9) = D_IVs.Text
        End If

        If (S_IVs_Enabled.Checked = False) Then
            For L = 0 To 31
                If (A_S_Real_Value(BSs(5), L, EVs(5), Lv, Nature_revise(4)) = RSs(5)) Then
                    IVs_MimMax(10) = Math.Min(IVs_MimMax(10), L)
                    IVs_MimMax(11) = Math.Max(IVs_MimMax(10), L)
                End If
            Next
        Else
            IVs_MimMax(10) = S_IVs.Text
            IVs_MimMax(11) = S_IVs.Text
        End If


        'ヌケニンの場合、可能性のあるHP個体値を0~31にする
        If (Pokemon_Basics(Name_Index) = "ヌケニン") Then
            IVs_MimMax(0) = 0
            IVs_MimMax(1) = 31
        End If


        '可能性のある個体値の最小値と最大値（表示用）
        If (IVs_MimMax(0) = IVs_MimMax(1)) Then
            Calced_HP_IVs.Text = IVs_MimMax(0)
        Else
            Calced_HP_IVs.Text = IVs_MimMax(0) & " ~ " & IVs_MimMax(1)
        End If
        Calced_HP_IVs.Update()

        If (IVs_MimMax(2) = IVs_MimMax(3)) Then
            Calced_A_IVs.Text = IVs_MimMax(2)
        Else
            Calced_A_IVs.Text = IVs_MimMax(2) & " ~ " & IVs_MimMax(3)
        End If
        Calced_A_IVs.Update()

        If (IVs_MimMax(4) = IVs_MimMax(5)) Then
            Calced_B_IVs.Text = IVs_MimMax(4)
        Else
            Calced_B_IVs.Text = IVs_MimMax(4) & " ~ " & IVs_MimMax(5)
        End If
        Calced_B_IVs.Update()

        If (IVs_MimMax(6) = IVs_MimMax(7)) Then
            Calced_C_IVs.Text = IVs_MimMax(6)
        Else
            Calced_C_IVs.Text = IVs_MimMax(6) & " ~ " & IVs_MimMax(7)
        End If
        Calced_C_IVs.Update()

        If (IVs_MimMax(8) = IVs_MimMax(9)) Then
            Calced_D_IVs.Text = IVs_MimMax(8)
        Else
            Calced_D_IVs.Text = IVs_MimMax(8) & " ~ " & IVs_MimMax(9)
        End If
        Calced_D_IVs.Update()

        If (IVs_MimMax(10) = IVs_MimMax(11)) Then
            Calced_S_IVs.Text = IVs_MimMax(10)
        Else
            Calced_S_IVs.Text = IVs_MimMax(10) & " ~ " & IVs_MimMax(11)
        End If
        Calced_S_IVs.Update()


        '実数値が不正な場合、計算をスキップする
        If (IVs_MimMax(0) = 99 Or IVs_MimMax(2) = 99 Or IVs_MimMax(4) = 99 Or IVs_MimMax(6) = 99 Or IVs_MimMax(8) = 99 Or IVs_MimMax(10) = 99 Or (Pokemon_Basics(Name_Index) = "ヌケニン" And RSs(0) <> 1)) Then
            Dim Warn_Msg As String = ""
            If IVs_MimMax(0) = 99 Then
                IVs_MimMax(0) = 0
                IVs_MimMax(1) = 31
                Calced_HP_IVs.Text = "不明"
                Calced_HP_IVs.Update()
                Warn_Msg += "HP、"
            End If
            If IVs_MimMax(2) = 99 Then
                IVs_MimMax(2) = 0
                IVs_MimMax(3) = 31
                Calced_A_IVs.Text = "不明"
                Calced_A_IVs.Update()
                Warn_Msg += "攻撃、"
            End If
            If IVs_MimMax(4) = 99 Then
                IVs_MimMax(4) = 0
                IVs_MimMax(5) = 31
                Calced_B_IVs.Text = "不明"
                Calced_B_IVs.Update()
                Warn_Msg += "防御、"
            End If
            If IVs_MimMax(6) = 99 Then
                IVs_MimMax(6) = 0
                IVs_MimMax(7) = 31
                Calced_C_IVs.Text = "不明"
                Calced_C_IVs.Update()
                Warn_Msg += "特攻、"
            End If
            If IVs_MimMax(8) = 99 Then
                IVs_MimMax(8) = 0
                IVs_MimMax(9) = 31
                Calced_D_IVs.Text = "不明"
                Calced_D_IVs.Update()
                Warn_Msg += "特防、"
            End If
            If IVs_MimMax(10) = 99 Then
                IVs_MimMax(10) = 0
                IVs_MimMax(11) = 31
                Calced_S_IVs.Text = "不明"
                Calced_S_IVs.Update()
                Warn_Msg += "素早さ、"
            End If

            'めざパ計算が無効の時は終了
            If (Hidden_Calc_Enabled.Checked = False) Then
                '実数値警告
                MessageBox.Show(Warn_Msg.TrimEnd(CType("、", Char)) + "の個体値が判断できません。", "実数値が不正です", MessageBoxButtons.OK, MessageBoxIcon.Error)
                If (Hidden_Calc_Enabled.Checked = False) Then Exit Sub
            Else
                '実数値警告
                If MessageBox.Show(Warn_Msg.TrimEnd(CType("、", Char)) + "の個体値が判断できません。この状態でめざめるパワーを計算しますか？", "実数値が不正です", MessageBoxButtons.YesNo, MessageBoxIcon.Exclamation) = DialogResult.No Then Exit Sub
            End If
        End If
        'めざパ計算が無効の時は終了
        If (Hidden_Calc_Enabled.Checked = False) Then Exit Sub


        'リスト
        Dim Hidden_Power_Type_0 As New List(Of String)
        Dim Hidden_Power_Type_1 As New List(Of String)
        Dim Hidden_Power_Type_2 As New List(Of String)
        Dim Hidden_Power_Type_3 As New List(Of String)
        Dim Hidden_Power_Type_4 As New List(Of String)
        Dim Hidden_Power_Type_5 As New List(Of String)
        Dim Hidden_Power_Type_6 As New List(Of String)
        Dim Hidden_Power_Type_7 As New List(Of String)
        Dim Hidden_Power_Type_8 As New List(Of String)
        Dim Hidden_Power_Type_9 As New List(Of String)
        Dim Hidden_Power_Type_10 As New List(Of String)
        Dim Hidden_Power_Type_11 As New List(Of String)
        Dim Hidden_Power_Type_12 As New List(Of String)
        Dim Hidden_Power_Type_13 As New List(Of String)
        Dim Hidden_Power_Type_14 As New List(Of String)
        Dim Hidden_Power_Type_15 As New List(Of String)

        Dim Hiiden_Power_Power_Calced_Count() As Integer = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}
        Dim Hiiden_Power_Found_Power_Count As Integer = 0


        '可能性のある個体値の組み合わせを全て計算する
        Dim Break As Integer = False
        Do While Break = False
            For HL = IVs_MimMax(0) To IVs_MimMax(1)
                '超過計算
                If (IVs_MimMax(0) + 4 <= HL) Then Exit For
                For AL = IVs_MimMax(2) To IVs_MimMax(3)
                    '超過計算
                    If (IVs_MimMax(2) + 4 <= AL) Then Exit For
                    For BL = IVs_MimMax(4) To IVs_MimMax(5)
                        '超過計算
                        If (IVs_MimMax(4) + 4 <= BL) Then Exit For
                        For CL = IVs_MimMax(6) To IVs_MimMax(7)
                            '超過計算
                            If (IVs_MimMax(6) + 4 <= CL) Then Exit For
                            For DL = IVs_MimMax(8) To IVs_MimMax(9)
                                '超過計算
                                If (IVs_MimMax(8) + 4 <= DL) Then Exit For
                                For SL = IVs_MimMax(10) To IVs_MimMax(11)

                                    Type_Total = 0
                                    If (HL Mod 2 = 1) Then Type_Total += 1
                                    If (AL Mod 2 = 1) Then Type_Total += 2
                                    If (BL Mod 2 = 1) Then Type_Total += 4
                                    If (SL Mod 2 = 1) Then Type_Total += 8
                                    If (CL Mod 2 = 1) Then Type_Total += 16
                                    If (DL Mod 2 = 1) Then Type_Total += 32

                                    Power_Total = 0
                                    If (HL Mod 4 = 2 Or HL Mod 4 = 3) Then Power_Total += 1
                                    If (AL Mod 4 = 2 Or AL Mod 4 = 3) Then Power_Total += 2
                                    If (BL Mod 4 = 2 Or BL Mod 4 = 3) Then Power_Total += 4
                                    If (SL Mod 4 = 2 Or SL Mod 4 = 3) Then Power_Total += 8
                                    If (CL Mod 4 = 2 Or CL Mod 4 = 3) Then Power_Total += 16
                                    If (DL Mod 4 = 2 Or DL Mod 4 = 3) Then Power_Total += 32

                                    If Math.Floor(Type_Total * 15 / 63) = 0 And Hidden_Power_Type_0.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_0.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(0) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 1 And Hidden_Power_Type_1.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_1.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(1) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 2 And Hidden_Power_Type_2.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_2.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(2) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 3 And Hidden_Power_Type_3.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_3.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(3) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 4 And Hidden_Power_Type_4.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_4.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(4) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 5 And Hidden_Power_Type_5.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_5.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(5) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 6 And Hidden_Power_Type_6.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_6.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(6) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 7 And Hidden_Power_Type_7.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_7.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(7) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 8 And Hidden_Power_Type_8.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_8.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(8) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 9 And Hidden_Power_Type_9.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_9.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(9) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 10 And Hidden_Power_Type_10.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_10.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(10) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 11 And Hidden_Power_Type_11.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_11.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(11) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 12 And Hidden_Power_Type_12.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_12.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(12) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 13 And Hidden_Power_Type_13.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_13.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(13) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 14 And Hidden_Power_Type_14.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_14.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(14) += 1
                                    End If

                                    If Math.Floor(Type_Total * 15 / 63) = 15 And Hidden_Power_Type_15.Contains(Math.Floor(Power_Total * 40 / 63 + 30)) = False Then
                                        Hidden_Power_Type_15.Add(Math.Floor(Power_Total * 40 / 63 + 30))
                                        Hiiden_Power_Power_Calced_Count(15) += 1
                                    End If

                                    '超過計算
                                    If (IVs_MimMax(10) + 4 <= SL) Then Exit For
                                Next
                            Next
                        Next
                    Next
                Next
            Next
            Break = True
        Loop


        '計算結果をソート
        Hidden_Power_Type_0.Sort()
        Hidden_Power_Type_1.Sort()
        Hidden_Power_Type_2.Sort()
        Hidden_Power_Type_3.Sort()
        Hidden_Power_Type_4.Sort()
        Hidden_Power_Type_5.Sort()
        Hidden_Power_Type_6.Sort()
        Hidden_Power_Type_7.Sort()
        Hidden_Power_Type_8.Sort()
        Hidden_Power_Type_9.Sort()
        Hidden_Power_Type_10.Sort()
        Hidden_Power_Type_11.Sort()
        Hidden_Power_Type_12.Sort()
        Hidden_Power_Type_13.Sort()
        Hidden_Power_Type_14.Sort()
        Hidden_Power_Type_15.Sort()

        'カンマを挿入
        Dim Calced_Hidden_Power_Powers() As String = {"", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""}

        For L = 0 To Hidden_Power_Type_0.Count - 1
            Calced_Hidden_Power_Powers(0) += Hidden_Power_Type_0(L)
            If (L <> Hidden_Power_Type_0.Count - 1) Then Calced_Hidden_Power_Powers(0) += ", "
        Next

        For L = 0 To Hidden_Power_Type_1.Count - 1
            Calced_Hidden_Power_Powers(1) += Hidden_Power_Type_1(L)
            If (L <> Hidden_Power_Type_1.Count - 1) Then Calced_Hidden_Power_Powers(1) += ", "
        Next

        For L = 0 To Hidden_Power_Type_2.Count - 1
            Calced_Hidden_Power_Powers(2) += Hidden_Power_Type_2(L)
            If (L <> Hidden_Power_Type_2.Count - 1) Then Calced_Hidden_Power_Powers(2) += ", "
        Next

        For L = 0 To Hidden_Power_Type_3.Count - 1
            Calced_Hidden_Power_Powers(3) += Hidden_Power_Type_3(L)
            If (L <> Hidden_Power_Type_3.Count - 1) Then Calced_Hidden_Power_Powers(3) += ", "
        Next

        For L = 0 To Hidden_Power_Type_4.Count - 1
            Calced_Hidden_Power_Powers(4) += Hidden_Power_Type_4(L)
            If (L <> Hidden_Power_Type_4.Count - 1) Then Calced_Hidden_Power_Powers(4) += ", "
        Next

        For L = 0 To Hidden_Power_Type_5.Count - 1
            Calced_Hidden_Power_Powers(5) += Hidden_Power_Type_5(L)
            If (L <> Hidden_Power_Type_5.Count - 1) Then Calced_Hidden_Power_Powers(5) += ", "
        Next

        For L = 0 To Hidden_Power_Type_6.Count - 1
            Calced_Hidden_Power_Powers(6) += Hidden_Power_Type_6(L)
            If (L <> Hidden_Power_Type_6.Count - 1) Then Calced_Hidden_Power_Powers(6) += ", "
        Next

        For L = 0 To Hidden_Power_Type_7.Count - 1
            Calced_Hidden_Power_Powers(7) += Hidden_Power_Type_7(L)
            If (L <> Hidden_Power_Type_7.Count - 1) Then Calced_Hidden_Power_Powers(7) += ", "
        Next

        For L = 0 To Hidden_Power_Type_8.Count - 1
            Calced_Hidden_Power_Powers(8) += Hidden_Power_Type_8(L)
            If (L <> Hidden_Power_Type_8.Count - 1) Then Calced_Hidden_Power_Powers(8) += ", "
        Next

        For L = 0 To Hidden_Power_Type_9.Count - 1
            Calced_Hidden_Power_Powers(9) += Hidden_Power_Type_9(L)
            If (L <> Hidden_Power_Type_9.Count - 1) Then Calced_Hidden_Power_Powers(9) += ", "
        Next

        For L = 0 To Hidden_Power_Type_10.Count - 1
            Calced_Hidden_Power_Powers(10) += Hidden_Power_Type_10(L)
            If (L <> Hidden_Power_Type_10.Count - 1) Then Calced_Hidden_Power_Powers(10) += ", "
        Next

        For L = 0 To Hidden_Power_Type_11.Count - 1
            Calced_Hidden_Power_Powers(11) += Hidden_Power_Type_11(L)
            If (L <> Hidden_Power_Type_11.Count - 1) Then Calced_Hidden_Power_Powers(11) += ", "
        Next

        For L = 0 To Hidden_Power_Type_12.Count - 1
            Calced_Hidden_Power_Powers(12) += Hidden_Power_Type_12(L)
            If (L <> Hidden_Power_Type_12.Count - 1) Then Calced_Hidden_Power_Powers(12) += ", "
        Next

        For L = 0 To Hidden_Power_Type_13.Count - 1
            Calced_Hidden_Power_Powers(13) += Hidden_Power_Type_13(L)
            If (L <> Hidden_Power_Type_13.Count - 1) Then Calced_Hidden_Power_Powers(13) += ", "
        Next

        For L = 0 To Hidden_Power_Type_14.Count - 1
            Calced_Hidden_Power_Powers(14) += Hidden_Power_Type_14(L)
            If (L <> Hidden_Power_Type_14.Count - 1) Then Calced_Hidden_Power_Powers(14) += ", "
        Next
        For L = 0 To Hidden_Power_Type_15.Count - 1
            Calced_Hidden_Power_Powers(15) += Hidden_Power_Type_15(L)
            If (L <> Hidden_Power_Type_15.Count - 1) Then Calced_Hidden_Power_Powers(15) += ", "
        Next


        'リスト整形
        Dim Type_Correspondence_Table() As String = {"かくとう： ", "ひこう： ", "どく： ", "じめん： ", "いわ： ", "むし： ", "ゴースト： ", "はがね： ", "ほのお： ", "みず： ", "くさ： ", "でんき： ", "エスパー： ", "こおり： ", "ドラゴン： ", "あく： "}
        For L = 0 To 15
            If (Calced_Hidden_Power_Powers(L).Length <> False) Then Calced_Power_and_Type.Items.Add(Type_Correspondence_Table(L) & "[" & Calced_Hidden_Power_Powers(L) & "]")
        Next

    End Sub


    '====================================================================================================================================================================

    'その他ボタン

    '====================================================================================================================================================================

    ' 個体値一括有効
    Private Sub IVs_All_Switch_CheckedChanged(sender As Object, e As EventArgs) Handles IVs_All_Switch.CheckedChanged
        If (IVs_All_Switch.Checked = True) Then
            HP_IVs_Enabled.Checked = True
            A_IVs_Enabled.Checked = True
            B_IVs_Enabled.Checked = True
            C_IVs_Enabled.Checked = True
            D_IVs_Enabled.Checked = True
            S_IVs_Enabled.Checked = True
        Else
            HP_IVs_Enabled.Checked = False
            A_IVs_Enabled.Checked = False
            B_IVs_Enabled.Checked = False
            C_IVs_Enabled.Checked = False
            D_IVs_Enabled.Checked = False
            S_IVs_Enabled.Checked = False
        End If
    End Sub


    '--- コピー ---
    '個体値
    Private Sub IVs_Copy_Click(sender As Object, e As EventArgs) Handles IVs_Copy.Click
        Dim Dummy As String = "[" & Calced_HP_IVs.Text & "]-[" & Calced_A_IVs.Text & "]-[" & Calced_B_IVs.Text & "]-[" & Calced_C_IVs.Text & "]-[" & Calced_D_IVs.Text & "]-[" & Calced_S_IVs.Text & "]"
        Clipboard.Clear()
        Clipboard.SetText(Calced_Pokemon.Text & " : " & Dummy.Replace(" ", ""))
    End Sub

    'めざパ
    Private Sub Hidden_Copy_Click(sender As Object, e As EventArgs) Handles Hidden_Copy.Click
        If (Calced_Power_and_Type.SelectedIndex <> -1) Then
            Clipboard.Clear()
            Clipboard.SetText(Calced_Power_and_Type.SelectedItems(0))
        End If
    End Sub


    '====================================================================================================================================================================

    'Functions

    '====================================================================================================================================================================

    ' プラス/マイナスボタン
    Public Function Plus(n As String) As Integer
        If (n = "") Then n = 0
        n += 1
        Return n
    End Function
    Public Function Minus(n As String) As Integer
        If (n = "") Then n = 0
        n -= 1
        If (n = -1) Then n = 0
        Return n
    End Function

    '実数値を取得
    Public Function HP_Real_Value(BSs As Integer, IVs As Integer, EVs As Integer, Lv As Integer) As Integer
        Dim n As Integer = Math.Floor(Math.Floor(((BSs * 2 + IVs + EVs / 4)) * Lv / 100) + Lv + 10)
        Return n
    End Function
    Public Function A_S_Real_Value(BSs As Integer, IVs As Integer, EVs As Integer, Lv As Integer, Nature As Double) As Integer
        Dim n As Integer = Math.Floor((Math.Floor(Math.Floor(BSs * 2 + IVs + EVs / 4) * Lv / 100) + 5) * Nature)
        Return n
    End Function

    '性格補正を取得
    Public Function Nature_Conversion(Nature As String) As Double()
        Dim n() As Double = {1, 1, 1, 1, 1}
        If (Nature = "さみしがり") Then
            n(0) = 1.1
            n(1) = 0.9
        End If
        If (Nature = "いじっぱり") Then
            n(0) = 1.1
            n(2) = 0.9
        End If
        If (Nature = "やんちゃ") Then
            n(0) = 1.1
            n(3) = 0.9
        End If
        If (Nature = "ゆうかん") Then
            n(0) = 1.1
            n(4) = 0.9
        End If
        If (Nature = "ずぶとい") Then
            n(1) = 1.1
            n(0) = 0.9
        End If
        If (Nature = "わんぱく") Then
            n(1) = 1.1
            n(2) = 0.9
        End If
        If (Nature = "のうてんき") Then
            n(1) = 1.1
            n(3) = 0.9
        End If
        If (Nature = "のんき") Then
            n(1) = 1.1
            n(4) = 0.9
        End If
        If (Nature = "ひかえめ") Then
            n(2) = 1.1
            n(0) = 0.9
        End If
        If (Nature = "おっとり") Then
            n(2) = 1.1
            n(1) = 0.9
        End If
        If (Nature = "うっかりや") Then
            n(2) = 1.1
            n(3) = 0.9
        End If
        If (Nature = "れいせい") Then
            n(2) = 1.1
            n(4) = 0.9
        End If
        If (Nature = "おだやか") Then
            n(3) = 1.1
            n(0) = 0.9
        End If
        If (Nature = "おとなしい") Then
            n(3) = 1.1
            n(1) = 0.9
        End If
        If (Nature = "しんちょう") Then
            n(3) = 1.1
            n(2) = 0.9
        End If
        If (Nature = "なまいき") Then
            n(3) = 1.1
            n(4) = 0.9
        End If
        If (Nature = "おくびょう") Then
            n(4) = 1.1
            n(0) = 0.9
        End If
        If (Nature = "せっかち") Then
            n(4) = 1.1
            n(1) = 0.9
        End If
        If (Nature = "ようき") Then
            n(4) = 1.1
            n(2) = 0.9
        End If
        If (Nature = "むじゃき") Then
            n(4) = 1.1
            n(3) = 0.9
        End If
        Return n
    End Function


End Class